GopalSaraf/Practicals/PSDL/include/proc/pic18f27q84.inc
// Register: DAC1DATL
#define DAC1DATL DAC1DATL
DAC1DATL                                 equ 007Dh
// bitfield definitions
DAC1DATL_DAC1R_POSN                      equ 0000h
DAC1DATL_DAC1R_POSITION                  equ 0000h
DAC1DATL_DAC1R_SIZE                      equ 0008h
DAC1DATL_DAC1R_LENGTH                    equ 0008h
DAC1DATL_DAC1R_MASK                      equ 00FFh
DAC1DATL_DAC1R0_POSN                     equ 0000h
DAC1DATL_DAC1R0_POSITION                 equ 0000h
DAC1DATL_DAC1R0_SIZE                     equ 0001h
DAC1DATL_DAC1R0_LENGTH                   equ 0001h
DAC1DATL_DAC1R0_MASK                     equ 0001h
DAC1DATL_DAC1R1_POSN                     equ 0001h
DAC1DATL_DAC1R1_POSITION                 equ 0001h
DAC1DATL_DAC1R1_SIZE                     equ 0001h
DAC1DATL_DAC1R1_LENGTH                   equ 0001h
DAC1DATL_DAC1R1_MASK                     equ 0002h
DAC1DATL_DAC1R2_POSN                     equ 0002h
DAC1DATL_DAC1R2_POSITION                 equ 0002h
DAC1DATL_DAC1R2_SIZE                     equ 0001h
DAC1DATL_DAC1R2_LENGTH                   equ 0001h
DAC1DATL_DAC1R2_MASK                     equ 0004h
DAC1DATL_DAC1R3_POSN                     equ 0003h
DAC1DATL_DAC1R3_POSITION                 equ 0003h
DAC1DATL_DAC1R3_SIZE                     equ 0001h
DAC1DATL_DAC1R3_LENGTH                   equ 0001h
DAC1DATL_DAC1R3_MASK                     equ 0008h
DAC1DATL_DAC1R4_POSN                     equ 0004h
DAC1DATL_DAC1R4_POSITION                 equ 0004h
DAC1DATL_DAC1R4_SIZE                     equ 0001h
DAC1DATL_DAC1R4_LENGTH                   equ 0001h
DAC1DATL_DAC1R4_MASK                     equ 0010h
DAC1DATL_DAC1R5_POSN                     equ 0005h
DAC1DATL_DAC1R5_POSITION                 equ 0005h
DAC1DATL_DAC1R5_SIZE                     equ 0001h
DAC1DATL_DAC1R5_LENGTH                   equ 0001h
DAC1DATL_DAC1R5_MASK                     equ 0020h
DAC1DATL_DAC1R6_POSN                     equ 0006h
DAC1DATL_DAC1R6_POSITION                 equ 0006h
DAC1DATL_DAC1R6_SIZE                     equ 0001h
DAC1DATL_DAC1R6_LENGTH                   equ 0001h
DAC1DATL_DAC1R6_MASK                     equ 0040h
DAC1DATL_DAC1R7_POSN                     equ 0007h
DAC1DATL_DAC1R7_POSITION                 equ 0007h
DAC1DATL_DAC1R7_SIZE                     equ 0001h
DAC1DATL_DAC1R7_LENGTH                   equ 0001h
DAC1DATL_DAC1R7_MASK                     equ 0080h
DAC1DATL_DAC1RL_POSN                     equ 0000h
DAC1DATL_DAC1RL_POSITION                 equ 0000h
DAC1DATL_DAC1RL_SIZE                     equ 0008h
DAC1DATL_DAC1RL_LENGTH                   equ 0008h
DAC1DATL_DAC1RL_MASK                     equ 00FFh

// Register: DAC1CON
#define DAC1CON DAC1CON
DAC1CON                                  equ 007Fh
// bitfield definitions
DAC1CON_NSS_POSN                         equ 0000h
DAC1CON_NSS_POSITION                     equ 0000h
DAC1CON_NSS_SIZE                         equ 0002h
DAC1CON_NSS_LENGTH                       equ 0002h
DAC1CON_NSS_MASK                         equ 0003h
DAC1CON_PSS_POSN                         equ 0002h
DAC1CON_PSS_POSITION                     equ 0002h
DAC1CON_PSS_SIZE                         equ 0002h
DAC1CON_PSS_LENGTH                       equ 0002h
DAC1CON_PSS_MASK                         equ 000Ch
DAC1CON_OE_POSN                          equ 0004h
DAC1CON_OE_POSITION                      equ 0004h
DAC1CON_OE_SIZE                          equ 0003h
DAC1CON_OE_LENGTH                        equ 0003h
DAC1CON_OE_MASK                          equ 0070h
DAC1CON_EN_POSN                          equ 0007h
DAC1CON_EN_POSITION                      equ 0007h
DAC1CON_EN_SIZE                          equ 0001h
DAC1CON_EN_LENGTH                        equ 0001h
DAC1CON_EN_MASK                          equ 0080h
DAC1CON_DAC1NSS_POSN                     equ 0000h
DAC1CON_DAC1NSS_POSITION                 equ 0000h
DAC1CON_DAC1NSS_SIZE                     equ 0002h
DAC1CON_DAC1NSS_LENGTH                   equ 0002h
DAC1CON_DAC1NSS_MASK                     equ 0003h
DAC1CON_DAC1PSS0_POSN                    equ 0002h
DAC1CON_DAC1PSS0_POSITION                equ 0002h
DAC1CON_DAC1PSS0_SIZE                    equ 0001h
DAC1CON_DAC1PSS0_LENGTH                  equ 0001h
DAC1CON_DAC1PSS0_MASK                    equ 0004h
DAC1CON_DAC1PSS1_POSN                    equ 0003h
DAC1CON_DAC1PSS1_POSITION                equ 0003h
DAC1CON_DAC1PSS1_SIZE                    equ 0001h
DAC1CON_DAC1PSS1_LENGTH                  equ 0001h
DAC1CON_DAC1PSS1_MASK                    equ 0008h
DAC1CON_DAC1OE_POSN                      equ 0004h
DAC1CON_DAC1OE_POSITION                  equ 0004h
DAC1CON_DAC1OE_SIZE                      equ 0003h
DAC1CON_DAC1OE_LENGTH                    equ 0003h
DAC1CON_DAC1OE_MASK                      equ 0070h
DAC1CON_DAC1EN_POSN                      equ 0007h
DAC1CON_DAC1EN_POSITION                  equ 0007h
DAC1CON_DAC1EN_SIZE                      equ 0001h
DAC1CON_DAC1EN_LENGTH                    equ 0001h
DAC1CON_DAC1EN_MASK                      equ 0080h
DAC1CON_NSS0_POSN                        equ 0000h
DAC1CON_NSS0_POSITION                    equ 0000h
DAC1CON_NSS0_SIZE                        equ 0001h
DAC1CON_NSS0_LENGTH                      equ 0001h
DAC1CON_NSS0_MASK                        equ 0001h
DAC1CON_PSS0_POSN                        equ 0002h
DAC1CON_PSS0_POSITION                    equ 0002h
DAC1CON_PSS0_SIZE                        equ 0001h
DAC1CON_PSS0_LENGTH                      equ 0001h
DAC1CON_PSS0_MASK                        equ 0004h
DAC1CON_PSS1_POSN                        equ 0003h
DAC1CON_PSS1_POSITION                    equ 0003h
DAC1CON_PSS1_SIZE                        equ 0001h
DAC1CON_PSS1_LENGTH                      equ 0001h
DAC1CON_PSS1_MASK                        equ 0008h
DAC1CON_OE0_POSN                         equ 0004h
DAC1CON_OE0_POSITION                     equ 0004h
DAC1CON_OE0_SIZE                         equ 0001h
DAC1CON_OE0_LENGTH                       equ 0001h
DAC1CON_OE0_MASK                         equ 0010h
DAC1CON_OE1_POSN                         equ 0005h
DAC1CON_OE1_POSITION                     equ 0005h
DAC1CON_OE1_SIZE                         equ 0001h
DAC1CON_OE1_LENGTH                       equ 0001h
DAC1CON_OE1_MASK                         equ 0020h

// Register: SPI1RXB
#define SPI1RXB SPI1RXB
SPI1RXB                                  equ 0080h
// bitfield definitions
SPI1RXB_RXB_POSN                         equ 0000h
SPI1RXB_RXB_POSITION                     equ 0000h
SPI1RXB_RXB_SIZE                         equ 0008h
SPI1RXB_RXB_LENGTH                       equ 0008h
SPI1RXB_RXB_MASK                         equ 00FFh
SPI1RXB_RXB0_POSN                        equ 0000h
SPI1RXB_RXB0_POSITION                    equ 0000h
SPI1RXB_RXB0_SIZE                        equ 0001h
SPI1RXB_RXB0_LENGTH                      equ 0001h
SPI1RXB_RXB0_MASK                        equ 0001h
SPI1RXB_RXB1_POSN                        equ 0001h
SPI1RXB_RXB1_POSITION                    equ 0001h
SPI1RXB_RXB1_SIZE                        equ 0001h
SPI1RXB_RXB1_LENGTH                      equ 0001h
SPI1RXB_RXB1_MASK                        equ 0002h
SPI1RXB_RXB2_POSN                        equ 0002h
SPI1RXB_RXB2_POSITION                    equ 0002h
SPI1RXB_RXB2_SIZE                        equ 0001h
SPI1RXB_RXB2_LENGTH                      equ 0001h
SPI1RXB_RXB2_MASK                        equ 0004h
SPI1RXB_RXB3_POSN                        equ 0003h
SPI1RXB_RXB3_POSITION                    equ 0003h
SPI1RXB_RXB3_SIZE                        equ 0001h
SPI1RXB_RXB3_LENGTH                      equ 0001h
SPI1RXB_RXB3_MASK                        equ 0008h
SPI1RXB_RXB4_POSN                        equ 0004h
SPI1RXB_RXB4_POSITION                    equ 0004h
SPI1RXB_RXB4_SIZE                        equ 0001h
SPI1RXB_RXB4_LENGTH                      equ 0001h
SPI1RXB_RXB4_MASK                        equ 0010h
SPI1RXB_RXB5_POSN                        equ 0005h
SPI1RXB_RXB5_POSITION                    equ 0005h
SPI1RXB_RXB5_SIZE                        equ 0001h
SPI1RXB_RXB5_LENGTH                      equ 0001h
SPI1RXB_RXB5_MASK                        equ 0020h
SPI1RXB_RXB6_POSN                        equ 0006h
SPI1RXB_RXB6_POSITION                    equ 0006h
SPI1RXB_RXB6_SIZE                        equ 0001h
SPI1RXB_RXB6_LENGTH                      equ 0001h
SPI1RXB_RXB6_MASK                        equ 0040h
SPI1RXB_RXB7_POSN                        equ 0007h
SPI1RXB_RXB7_POSITION                    equ 0007h
SPI1RXB_RXB7_SIZE                        equ 0001h
SPI1RXB_RXB7_LENGTH                      equ 0001h
SPI1RXB_RXB7_MASK                        equ 0080h

// Register: SPI1TXB
#define SPI1TXB SPI1TXB
SPI1TXB                                  equ 0081h
// bitfield definitions
SPI1TXB_TXB_POSN                         equ 0000h
SPI1TXB_TXB_POSITION                     equ 0000h
SPI1TXB_TXB_SIZE                         equ 0008h
SPI1TXB_TXB_LENGTH                       equ 0008h
SPI1TXB_TXB_MASK                         equ 00FFh
SPI1TXB_TXB0_POSN                        equ 0000h
SPI1TXB_TXB0_POSITION                    equ 0000h
SPI1TXB_TXB0_SIZE                        equ 0001h
SPI1TXB_TXB0_LENGTH                      equ 0001h
SPI1TXB_TXB0_MASK                        equ 0001h
SPI1TXB_TXB1_POSN                        equ 0001h
SPI1TXB_TXB1_POSITION                    equ 0001h
SPI1TXB_TXB1_SIZE                        equ 0001h
SPI1TXB_TXB1_LENGTH                      equ 0001h
SPI1TXB_TXB1_MASK                        equ 0002h
SPI1TXB_TXB2_POSN                        equ 0002h
SPI1TXB_TXB2_POSITION                    equ 0002h
SPI1TXB_TXB2_SIZE                        equ 0001h
SPI1TXB_TXB2_LENGTH                      equ 0001h
SPI1TXB_TXB2_MASK                        equ 0004h
SPI1TXB_TXB3_POSN                        equ 0003h
SPI1TXB_TXB3_POSITION                    equ 0003h
SPI1TXB_TXB3_SIZE                        equ 0001h
SPI1TXB_TXB3_LENGTH                      equ 0001h
SPI1TXB_TXB3_MASK                        equ 0008h
SPI1TXB_TXB4_POSN                        equ 0004h
SPI1TXB_TXB4_POSITION                    equ 0004h
SPI1TXB_TXB4_SIZE                        equ 0001h
SPI1TXB_TXB4_LENGTH                      equ 0001h
SPI1TXB_TXB4_MASK                        equ 0010h
SPI1TXB_TXB5_POSN                        equ 0005h
SPI1TXB_TXB5_POSITION                    equ 0005h
SPI1TXB_TXB5_SIZE                        equ 0001h
SPI1TXB_TXB5_LENGTH                      equ 0001h
SPI1TXB_TXB5_MASK                        equ 0020h
SPI1TXB_TXB6_POSN                        equ 0006h
SPI1TXB_TXB6_POSITION                    equ 0006h
SPI1TXB_TXB6_SIZE                        equ 0001h
SPI1TXB_TXB6_LENGTH                      equ 0001h
SPI1TXB_TXB6_MASK                        equ 0040h
SPI1TXB_TXB7_POSN                        equ 0007h
SPI1TXB_TXB7_POSITION                    equ 0007h
SPI1TXB_TXB7_SIZE                        equ 0001h
SPI1TXB_TXB7_LENGTH                      equ 0001h
SPI1TXB_TXB7_MASK                        equ 0080h

// Register: SPI1TCNT
#define SPI1TCNT SPI1TCNT
SPI1TCNT                                 equ 0082h

// Register: SPI1TCNTL
#define SPI1TCNTL SPI1TCNTL
SPI1TCNTL                                equ 0082h
// bitfield definitions
SPI1TCNTL_TCNTL_POSN                     equ 0000h
SPI1TCNTL_TCNTL_POSITION                 equ 0000h
SPI1TCNTL_TCNTL_SIZE                     equ 0008h
SPI1TCNTL_TCNTL_LENGTH                   equ 0008h
SPI1TCNTL_TCNTL_MASK                     equ 00FFh

