GopalSaraf/Practicals/PSDL/include/proc/pic18f27q84.inc
// Register: C1CONT
#define C1CONT C1CONT
C1CONT                                   equ 0103h
// bitfield definitions
C1CONT_REQOP_POSN                        equ 0000h
C1CONT_REQOP_POSITION                    equ 0000h
C1CONT_REQOP_SIZE                        equ 0003h
C1CONT_REQOP_LENGTH                      equ 0003h
C1CONT_REQOP_MASK                        equ 0007h
C1CONT_ABAT_POSN                         equ 0003h
C1CONT_ABAT_POSITION                     equ 0003h
C1CONT_ABAT_SIZE                         equ 0001h
C1CONT_ABAT_LENGTH                       equ 0001h
C1CONT_ABAT_MASK                         equ 0008h
C1CONT_TXBWS_POSN                        equ 0004h
C1CONT_TXBWS_POSITION                    equ 0004h
C1CONT_TXBWS_SIZE                        equ 0004h
C1CONT_TXBWS_LENGTH                      equ 0004h
C1CONT_TXBWS_MASK                        equ 00F0h
C1CONT_REQOP0_POSN                       equ 0000h
C1CONT_REQOP0_POSITION                   equ 0000h
C1CONT_REQOP0_SIZE                       equ 0001h
C1CONT_REQOP0_LENGTH                     equ 0001h
C1CONT_REQOP0_MASK                       equ 0001h
C1CONT_REQOP1_POSN                       equ 0001h
C1CONT_REQOP1_POSITION                   equ 0001h
C1CONT_REQOP1_SIZE                       equ 0001h
C1CONT_REQOP1_LENGTH                     equ 0001h
C1CONT_REQOP1_MASK                       equ 0002h
C1CONT_REQOP2_POSN                       equ 0002h
C1CONT_REQOP2_POSITION                   equ 0002h
C1CONT_REQOP2_SIZE                       equ 0001h
C1CONT_REQOP2_LENGTH                     equ 0001h
C1CONT_REQOP2_MASK                       equ 0004h
C1CONT_TXBWS0_POSN                       equ 0004h
C1CONT_TXBWS0_POSITION                   equ 0004h
C1CONT_TXBWS0_SIZE                       equ 0001h
C1CONT_TXBWS0_LENGTH                     equ 0001h
C1CONT_TXBWS0_MASK                       equ 0010h
C1CONT_TXBWS1_POSN                       equ 0005h
C1CONT_TXBWS1_POSITION                   equ 0005h
C1CONT_TXBWS1_SIZE                       equ 0001h
C1CONT_TXBWS1_LENGTH                     equ 0001h
C1CONT_TXBWS1_MASK                       equ 0020h
C1CONT_TXBWS2_POSN                       equ 0006h
C1CONT_TXBWS2_POSITION                   equ 0006h
C1CONT_TXBWS2_SIZE                       equ 0001h
C1CONT_TXBWS2_LENGTH                     equ 0001h
C1CONT_TXBWS2_MASK                       equ 0040h
C1CONT_TXBWS3_POSN                       equ 0007h
C1CONT_TXBWS3_POSITION                   equ 0007h
C1CONT_TXBWS3_SIZE                       equ 0001h
C1CONT_TXBWS3_LENGTH                     equ 0001h
C1CONT_TXBWS3_MASK                       equ 0080h

// Register: C1NBTCFGL
#define C1NBTCFGL C1NBTCFGL
C1NBTCFGL                                equ 0104h
// bitfield definitions
C1NBTCFGL_SJW_POSN                       equ 0000h
C1NBTCFGL_SJW_POSITION                   equ 0000h
C1NBTCFGL_SJW_SIZE                       equ 0007h
C1NBTCFGL_SJW_LENGTH                     equ 0007h
C1NBTCFGL_SJW_MASK                       equ 007Fh
C1NBTCFGL_SJW0_POSN                      equ 0000h
C1NBTCFGL_SJW0_POSITION                  equ 0000h
C1NBTCFGL_SJW0_SIZE                      equ 0001h
C1NBTCFGL_SJW0_LENGTH                    equ 0001h
C1NBTCFGL_SJW0_MASK                      equ 0001h
C1NBTCFGL_SJW1_POSN                      equ 0001h
C1NBTCFGL_SJW1_POSITION                  equ 0001h
C1NBTCFGL_SJW1_SIZE                      equ 0001h
C1NBTCFGL_SJW1_LENGTH                    equ 0001h
C1NBTCFGL_SJW1_MASK                      equ 0002h
C1NBTCFGL_SJW2_POSN                      equ 0002h
C1NBTCFGL_SJW2_POSITION                  equ 0002h
C1NBTCFGL_SJW2_SIZE                      equ 0001h
C1NBTCFGL_SJW2_LENGTH                    equ 0001h
C1NBTCFGL_SJW2_MASK                      equ 0004h
C1NBTCFGL_SJW3_POSN                      equ 0003h
C1NBTCFGL_SJW3_POSITION                  equ 0003h
C1NBTCFGL_SJW3_SIZE                      equ 0001h
C1NBTCFGL_SJW3_LENGTH                    equ 0001h
C1NBTCFGL_SJW3_MASK                      equ 0008h
C1NBTCFGL_SJW4_POSN                      equ 0004h
C1NBTCFGL_SJW4_POSITION                  equ 0004h
C1NBTCFGL_SJW4_SIZE                      equ 0001h
C1NBTCFGL_SJW4_LENGTH                    equ 0001h
C1NBTCFGL_SJW4_MASK                      equ 0010h
C1NBTCFGL_SJW5_POSN                      equ 0005h
C1NBTCFGL_SJW5_POSITION                  equ 0005h
C1NBTCFGL_SJW5_SIZE                      equ 0001h
C1NBTCFGL_SJW5_LENGTH                    equ 0001h
C1NBTCFGL_SJW5_MASK                      equ 0020h
C1NBTCFGL_SJW6_POSN                      equ 0006h
C1NBTCFGL_SJW6_POSITION                  equ 0006h
C1NBTCFGL_SJW6_SIZE                      equ 0001h
C1NBTCFGL_SJW6_LENGTH                    equ 0001h
C1NBTCFGL_SJW6_MASK                      equ 0040h

// Register: C1NBTCFGH
#define C1NBTCFGH C1NBTCFGH
C1NBTCFGH                                equ 0105h
// bitfield definitions
C1NBTCFGH_TSEG2_POSN                     equ 0000h
C1NBTCFGH_TSEG2_POSITION                 equ 0000h
C1NBTCFGH_TSEG2_SIZE                     equ 0007h
C1NBTCFGH_TSEG2_LENGTH                   equ 0007h
C1NBTCFGH_TSEG2_MASK                     equ 007Fh
C1NBTCFGH_TSEG20_POSN                    equ 0000h
C1NBTCFGH_TSEG20_POSITION                equ 0000h
C1NBTCFGH_TSEG20_SIZE                    equ 0001h
C1NBTCFGH_TSEG20_LENGTH                  equ 0001h
C1NBTCFGH_TSEG20_MASK                    equ 0001h
C1NBTCFGH_TSEG21_POSN                    equ 0001h
C1NBTCFGH_TSEG21_POSITION                equ 0001h
C1NBTCFGH_TSEG21_SIZE                    equ 0001h
C1NBTCFGH_TSEG21_LENGTH                  equ 0001h
C1NBTCFGH_TSEG21_MASK                    equ 0002h
C1NBTCFGH_TSEG22_POSN                    equ 0002h
C1NBTCFGH_TSEG22_POSITION                equ 0002h
C1NBTCFGH_TSEG22_SIZE                    equ 0001h
C1NBTCFGH_TSEG22_LENGTH                  equ 0001h
C1NBTCFGH_TSEG22_MASK                    equ 0004h
C1NBTCFGH_TSEG23_POSN                    equ 0003h
C1NBTCFGH_TSEG23_POSITION                equ 0003h
C1NBTCFGH_TSEG23_SIZE                    equ 0001h
C1NBTCFGH_TSEG23_LENGTH                  equ 0001h
C1NBTCFGH_TSEG23_MASK                    equ 0008h
C1NBTCFGH_TSEG24_POSN                    equ 0004h
C1NBTCFGH_TSEG24_POSITION                equ 0004h
C1NBTCFGH_TSEG24_SIZE                    equ 0001h
C1NBTCFGH_TSEG24_LENGTH                  equ 0001h
C1NBTCFGH_TSEG24_MASK                    equ 0010h
C1NBTCFGH_TSEG25_POSN                    equ 0005h
C1NBTCFGH_TSEG25_POSITION                equ 0005h
C1NBTCFGH_TSEG25_SIZE                    equ 0001h
C1NBTCFGH_TSEG25_LENGTH                  equ 0001h
C1NBTCFGH_TSEG25_MASK                    equ 0020h
C1NBTCFGH_TSEG26_POSN                    equ 0006h
C1NBTCFGH_TSEG26_POSITION                equ 0006h
C1NBTCFGH_TSEG26_SIZE                    equ 0001h
C1NBTCFGH_TSEG26_LENGTH                  equ 0001h
C1NBTCFGH_TSEG26_MASK                    equ 0040h

// Register: C1NBTCFGU
#define C1NBTCFGU C1NBTCFGU
C1NBTCFGU                                equ 0106h
// bitfield definitions
C1NBTCFGU_TSEG1_POSN                     equ 0000h
C1NBTCFGU_TSEG1_POSITION                 equ 0000h
C1NBTCFGU_TSEG1_SIZE                     equ 0008h
C1NBTCFGU_TSEG1_LENGTH                   equ 0008h
C1NBTCFGU_TSEG1_MASK                     equ 00FFh
C1NBTCFGU_TSEG10_POSN                    equ 0000h
C1NBTCFGU_TSEG10_POSITION                equ 0000h
C1NBTCFGU_TSEG10_SIZE                    equ 0001h
C1NBTCFGU_TSEG10_LENGTH                  equ 0001h
C1NBTCFGU_TSEG10_MASK                    equ 0001h
C1NBTCFGU_TSEG11_POSN                    equ 0001h
C1NBTCFGU_TSEG11_POSITION                equ 0001h
C1NBTCFGU_TSEG11_SIZE                    equ 0001h
C1NBTCFGU_TSEG11_LENGTH                  equ 0001h
C1NBTCFGU_TSEG11_MASK                    equ 0002h
C1NBTCFGU_TSEG12_POSN                    equ 0002h
C1NBTCFGU_TSEG12_POSITION                equ 0002h
C1NBTCFGU_TSEG12_SIZE                    equ 0001h
C1NBTCFGU_TSEG12_LENGTH                  equ 0001h
C1NBTCFGU_TSEG12_MASK                    equ 0004h
C1NBTCFGU_TSEG13_POSN                    equ 0003h
C1NBTCFGU_TSEG13_POSITION                equ 0003h
C1NBTCFGU_TSEG13_SIZE                    equ 0001h
C1NBTCFGU_TSEG13_LENGTH                  equ 0001h
C1NBTCFGU_TSEG13_MASK                    equ 0008h
C1NBTCFGU_TSEG14_POSN                    equ 0004h
C1NBTCFGU_TSEG14_POSITION                equ 0004h
C1NBTCFGU_TSEG14_SIZE                    equ 0001h
C1NBTCFGU_TSEG14_LENGTH                  equ 0001h
C1NBTCFGU_TSEG14_MASK                    equ 0010h
C1NBTCFGU_TSEG15_POSN                    equ 0005h
C1NBTCFGU_TSEG15_POSITION                equ 0005h
C1NBTCFGU_TSEG15_SIZE                    equ 0001h
C1NBTCFGU_TSEG15_LENGTH                  equ 0001h
C1NBTCFGU_TSEG15_MASK                    equ 0020h
C1NBTCFGU_TSEG16_POSN                    equ 0006h
C1NBTCFGU_TSEG16_POSITION                equ 0006h
C1NBTCFGU_TSEG16_SIZE                    equ 0001h
C1NBTCFGU_TSEG16_LENGTH                  equ 0001h
C1NBTCFGU_TSEG16_MASK                    equ 0040h
C1NBTCFGU_TSEG17_POSN                    equ 0007h
C1NBTCFGU_TSEG17_POSITION                equ 0007h
C1NBTCFGU_TSEG17_SIZE                    equ 0001h
C1NBTCFGU_TSEG17_LENGTH                  equ 0001h
C1NBTCFGU_TSEG17_MASK                    equ 0080h

