GopalSaraf/Practicals/PSDL/include/proc/pic18f27q84.inc
// Register: C1TXATIFH
#define C1TXATIFH C1TXATIFH
C1TXATIFH                                equ 012Dh
// bitfield definitions
C1TXATIFH_TFATIF_POSN                    equ 0000h
C1TXATIFH_TFATIF_POSITION                equ 0000h
C1TXATIFH_TFATIF_SIZE                    equ 0008h
C1TXATIFH_TFATIF_LENGTH                  equ 0008h
C1TXATIFH_TFATIF_MASK                    equ 00FFh
C1TXATIFH_TFATIF8_POSN                   equ 0000h
C1TXATIFH_TFATIF8_POSITION               equ 0000h
C1TXATIFH_TFATIF8_SIZE                   equ 0001h
C1TXATIFH_TFATIF8_LENGTH                 equ 0001h
C1TXATIFH_TFATIF8_MASK                   equ 0001h
C1TXATIFH_TFATIF9_POSN                   equ 0001h
C1TXATIFH_TFATIF9_POSITION               equ 0001h
C1TXATIFH_TFATIF9_SIZE                   equ 0001h
C1TXATIFH_TFATIF9_LENGTH                 equ 0001h
C1TXATIFH_TFATIF9_MASK                   equ 0002h
C1TXATIFH_TFATIF10_POSN                  equ 0002h
C1TXATIFH_TFATIF10_POSITION              equ 0002h
C1TXATIFH_TFATIF10_SIZE                  equ 0001h
C1TXATIFH_TFATIF10_LENGTH                equ 0001h
C1TXATIFH_TFATIF10_MASK                  equ 0004h
C1TXATIFH_TFATIF11_POSN                  equ 0003h
C1TXATIFH_TFATIF11_POSITION              equ 0003h
C1TXATIFH_TFATIF11_SIZE                  equ 0001h
C1TXATIFH_TFATIF11_LENGTH                equ 0001h
C1TXATIFH_TFATIF11_MASK                  equ 0008h
C1TXATIFH_TFATIF12_POSN                  equ 0004h
C1TXATIFH_TFATIF12_POSITION              equ 0004h
C1TXATIFH_TFATIF12_SIZE                  equ 0001h
C1TXATIFH_TFATIF12_LENGTH                equ 0001h
C1TXATIFH_TFATIF12_MASK                  equ 0010h
C1TXATIFH_TFATIF13_POSN                  equ 0005h
C1TXATIFH_TFATIF13_POSITION              equ 0005h
C1TXATIFH_TFATIF13_SIZE                  equ 0001h
C1TXATIFH_TFATIF13_LENGTH                equ 0001h
C1TXATIFH_TFATIF13_MASK                  equ 0020h
C1TXATIFH_TFATIF14_POSN                  equ 0006h
C1TXATIFH_TFATIF14_POSITION              equ 0006h
C1TXATIFH_TFATIF14_SIZE                  equ 0001h
C1TXATIFH_TFATIF14_LENGTH                equ 0001h
C1TXATIFH_TFATIF14_MASK                  equ 0040h
C1TXATIFH_TFATIF15_POSN                  equ 0007h
C1TXATIFH_TFATIF15_POSITION              equ 0007h
C1TXATIFH_TFATIF15_SIZE                  equ 0001h
C1TXATIFH_TFATIF15_LENGTH                equ 0001h
C1TXATIFH_TFATIF15_MASK                  equ 0080h

// Register: C1TXATIFU
#define C1TXATIFU C1TXATIFU
C1TXATIFU                                equ 012Eh
// bitfield definitions
C1TXATIFU_TFATIF_POSN                    equ 0000h
C1TXATIFU_TFATIF_POSITION                equ 0000h
C1TXATIFU_TFATIF_SIZE                    equ 0008h
C1TXATIFU_TFATIF_LENGTH                  equ 0008h
C1TXATIFU_TFATIF_MASK                    equ 00FFh
C1TXATIFU_TFATIF16_POSN                  equ 0000h
C1TXATIFU_TFATIF16_POSITION              equ 0000h
C1TXATIFU_TFATIF16_SIZE                  equ 0001h
C1TXATIFU_TFATIF16_LENGTH                equ 0001h
C1TXATIFU_TFATIF16_MASK                  equ 0001h
C1TXATIFU_TFATIF17_POSN                  equ 0001h
C1TXATIFU_TFATIF17_POSITION              equ 0001h
C1TXATIFU_TFATIF17_SIZE                  equ 0001h
C1TXATIFU_TFATIF17_LENGTH                equ 0001h
C1TXATIFU_TFATIF17_MASK                  equ 0002h
C1TXATIFU_TFATIF18_POSN                  equ 0002h
C1TXATIFU_TFATIF18_POSITION              equ 0002h
C1TXATIFU_TFATIF18_SIZE                  equ 0001h
C1TXATIFU_TFATIF18_LENGTH                equ 0001h
C1TXATIFU_TFATIF18_MASK                  equ 0004h
C1TXATIFU_TFATIF19_POSN                  equ 0003h
C1TXATIFU_TFATIF19_POSITION              equ 0003h
C1TXATIFU_TFATIF19_SIZE                  equ 0001h
C1TXATIFU_TFATIF19_LENGTH                equ 0001h
C1TXATIFU_TFATIF19_MASK                  equ 0008h
C1TXATIFU_TFATIF20_POSN                  equ 0004h
C1TXATIFU_TFATIF20_POSITION              equ 0004h
C1TXATIFU_TFATIF20_SIZE                  equ 0001h
C1TXATIFU_TFATIF20_LENGTH                equ 0001h
C1TXATIFU_TFATIF20_MASK                  equ 0010h
C1TXATIFU_TFATIF21_POSN                  equ 0005h
C1TXATIFU_TFATIF21_POSITION              equ 0005h
C1TXATIFU_TFATIF21_SIZE                  equ 0001h
C1TXATIFU_TFATIF21_LENGTH                equ 0001h
C1TXATIFU_TFATIF21_MASK                  equ 0020h
C1TXATIFU_TFATIF22_POSN                  equ 0006h
C1TXATIFU_TFATIF22_POSITION              equ 0006h
C1TXATIFU_TFATIF22_SIZE                  equ 0001h
C1TXATIFU_TFATIF22_LENGTH                equ 0001h
C1TXATIFU_TFATIF22_MASK                  equ 0040h
C1TXATIFU_TFATIF23_POSN                  equ 0007h
C1TXATIFU_TFATIF23_POSITION              equ 0007h
C1TXATIFU_TFATIF23_SIZE                  equ 0001h
C1TXATIFU_TFATIF23_LENGTH                equ 0001h
C1TXATIFU_TFATIF23_MASK                  equ 0080h

// Register: C1TXATIFT
#define C1TXATIFT C1TXATIFT
C1TXATIFT                                equ 012Fh
// bitfield definitions
C1TXATIFT_TFATIF_POSN                    equ 0000h
C1TXATIFT_TFATIF_POSITION                equ 0000h
C1TXATIFT_TFATIF_SIZE                    equ 0008h
C1TXATIFT_TFATIF_LENGTH                  equ 0008h
C1TXATIFT_TFATIF_MASK                    equ 00FFh
C1TXATIFT_TFATIF24_POSN                  equ 0000h
C1TXATIFT_TFATIF24_POSITION              equ 0000h
C1TXATIFT_TFATIF24_SIZE                  equ 0001h
C1TXATIFT_TFATIF24_LENGTH                equ 0001h
C1TXATIFT_TFATIF24_MASK                  equ 0001h
C1TXATIFT_TFATIF25_POSN                  equ 0001h
C1TXATIFT_TFATIF25_POSITION              equ 0001h
C1TXATIFT_TFATIF25_SIZE                  equ 0001h
C1TXATIFT_TFATIF25_LENGTH                equ 0001h
C1TXATIFT_TFATIF25_MASK                  equ 0002h
C1TXATIFT_TFATIF26_POSN                  equ 0002h
C1TXATIFT_TFATIF26_POSITION              equ 0002h
C1TXATIFT_TFATIF26_SIZE                  equ 0001h
C1TXATIFT_TFATIF26_LENGTH                equ 0001h
C1TXATIFT_TFATIF26_MASK                  equ 0004h
C1TXATIFT_TFATIF27_POSN                  equ 0003h
C1TXATIFT_TFATIF27_POSITION              equ 0003h
C1TXATIFT_TFATIF27_SIZE                  equ 0001h
C1TXATIFT_TFATIF27_LENGTH                equ 0001h
C1TXATIFT_TFATIF27_MASK                  equ 0008h
C1TXATIFT_TFATIF28_POSN                  equ 0004h
C1TXATIFT_TFATIF28_POSITION              equ 0004h
C1TXATIFT_TFATIF28_SIZE                  equ 0001h
C1TXATIFT_TFATIF28_LENGTH                equ 0001h
C1TXATIFT_TFATIF28_MASK                  equ 0010h
C1TXATIFT_TFATIF29_POSN                  equ 0005h
C1TXATIFT_TFATIF29_POSITION              equ 0005h
C1TXATIFT_TFATIF29_SIZE                  equ 0001h
C1TXATIFT_TFATIF29_LENGTH                equ 0001h
C1TXATIFT_TFATIF29_MASK                  equ 0020h
C1TXATIFT_TFATIF30_POSN                  equ 0006h
C1TXATIFT_TFATIF30_POSITION              equ 0006h
C1TXATIFT_TFATIF30_SIZE                  equ 0001h
C1TXATIFT_TFATIF30_LENGTH                equ 0001h
C1TXATIFT_TFATIF30_MASK                  equ 0040h
C1TXATIFT_TFATIF31_POSN                  equ 0007h
C1TXATIFT_TFATIF31_POSITION              equ 0007h
C1TXATIFT_TFATIF31_SIZE                  equ 0001h
C1TXATIFT_TFATIF31_LENGTH                equ 0001h
C1TXATIFT_TFATIF31_MASK                  equ 0080h

