GopalSaraf/Practicals/PSDL/include/proc/pic18f27q84.inc
// Register: C1FLTOBJ11U
#define C1FLTOBJ11U C1FLTOBJ11U
C1FLTOBJ11U                              equ 01E6h
// bitfield definitions
C1FLTOBJ11U_EID_POSN                     equ 0000h
C1FLTOBJ11U_EID_POSITION                 equ 0000h
C1FLTOBJ11U_EID_SIZE                     equ 0008h
C1FLTOBJ11U_EID_LENGTH                   equ 0008h
C1FLTOBJ11U_EID_MASK                     equ 00FFh
C1FLTOBJ11U_EID5_POSN                    equ 0000h
C1FLTOBJ11U_EID5_POSITION                equ 0000h
C1FLTOBJ11U_EID5_SIZE                    equ 0001h
C1FLTOBJ11U_EID5_LENGTH                  equ 0001h
C1FLTOBJ11U_EID5_MASK                    equ 0001h
C1FLTOBJ11U_EID6_POSN                    equ 0001h
C1FLTOBJ11U_EID6_POSITION                equ 0001h
C1FLTOBJ11U_EID6_SIZE                    equ 0001h
C1FLTOBJ11U_EID6_LENGTH                  equ 0001h
C1FLTOBJ11U_EID6_MASK                    equ 0002h
C1FLTOBJ11U_EID7_POSN                    equ 0002h
C1FLTOBJ11U_EID7_POSITION                equ 0002h
C1FLTOBJ11U_EID7_SIZE                    equ 0001h
C1FLTOBJ11U_EID7_LENGTH                  equ 0001h
C1FLTOBJ11U_EID7_MASK                    equ 0004h
C1FLTOBJ11U_EID8_POSN                    equ 0003h
C1FLTOBJ11U_EID8_POSITION                equ 0003h
C1FLTOBJ11U_EID8_SIZE                    equ 0001h
C1FLTOBJ11U_EID8_LENGTH                  equ 0001h
C1FLTOBJ11U_EID8_MASK                    equ 0008h
C1FLTOBJ11U_EID9_POSN                    equ 0004h
C1FLTOBJ11U_EID9_POSITION                equ 0004h
C1FLTOBJ11U_EID9_SIZE                    equ 0001h
C1FLTOBJ11U_EID9_LENGTH                  equ 0001h
C1FLTOBJ11U_EID9_MASK                    equ 0010h
C1FLTOBJ11U_EID10_POSN                   equ 0005h
C1FLTOBJ11U_EID10_POSITION               equ 0005h
C1FLTOBJ11U_EID10_SIZE                   equ 0001h
C1FLTOBJ11U_EID10_LENGTH                 equ 0001h
C1FLTOBJ11U_EID10_MASK                   equ 0020h
C1FLTOBJ11U_EID11_POSN                   equ 0006h
C1FLTOBJ11U_EID11_POSITION               equ 0006h
C1FLTOBJ11U_EID11_SIZE                   equ 0001h
C1FLTOBJ11U_EID11_LENGTH                 equ 0001h
C1FLTOBJ11U_EID11_MASK                   equ 0040h
C1FLTOBJ11U_EID12_POSN                   equ 0007h
C1FLTOBJ11U_EID12_POSITION               equ 0007h
C1FLTOBJ11U_EID12_SIZE                   equ 0001h
C1FLTOBJ11U_EID12_LENGTH                 equ 0001h
C1FLTOBJ11U_EID12_MASK                   equ 0080h

// Register: C1FLTOBJ11T
#define C1FLTOBJ11T C1FLTOBJ11T
C1FLTOBJ11T                              equ 01E7h
// bitfield definitions
C1FLTOBJ11T_EID_POSN                     equ 0000h
C1FLTOBJ11T_EID_POSITION                 equ 0000h
C1FLTOBJ11T_EID_SIZE                     equ 0005h
C1FLTOBJ11T_EID_LENGTH                   equ 0005h
C1FLTOBJ11T_EID_MASK                     equ 001Fh
C1FLTOBJ11T_SID11_POSN                   equ 0005h
C1FLTOBJ11T_SID11_POSITION               equ 0005h
C1FLTOBJ11T_SID11_SIZE                   equ 0001h
C1FLTOBJ11T_SID11_LENGTH                 equ 0001h
C1FLTOBJ11T_SID11_MASK                   equ 0020h
C1FLTOBJ11T_EXIDE_POSN                   equ 0006h
C1FLTOBJ11T_EXIDE_POSITION               equ 0006h
C1FLTOBJ11T_EXIDE_SIZE                   equ 0001h
C1FLTOBJ11T_EXIDE_LENGTH                 equ 0001h
C1FLTOBJ11T_EXIDE_MASK                   equ 0040h
C1FLTOBJ11T_EID13_POSN                   equ 0000h
C1FLTOBJ11T_EID13_POSITION               equ 0000h
C1FLTOBJ11T_EID13_SIZE                   equ 0001h
C1FLTOBJ11T_EID13_LENGTH                 equ 0001h
C1FLTOBJ11T_EID13_MASK                   equ 0001h
C1FLTOBJ11T_EID14_POSN                   equ 0001h
C1FLTOBJ11T_EID14_POSITION               equ 0001h
C1FLTOBJ11T_EID14_SIZE                   equ 0001h
C1FLTOBJ11T_EID14_LENGTH                 equ 0001h
C1FLTOBJ11T_EID14_MASK                   equ 0002h
C1FLTOBJ11T_EID15_POSN                   equ 0002h
C1FLTOBJ11T_EID15_POSITION               equ 0002h
C1FLTOBJ11T_EID15_SIZE                   equ 0001h
C1FLTOBJ11T_EID15_LENGTH                 equ 0001h
C1FLTOBJ11T_EID15_MASK                   equ 0004h
C1FLTOBJ11T_EID16_POSN                   equ 0003h
C1FLTOBJ11T_EID16_POSITION               equ 0003h
C1FLTOBJ11T_EID16_SIZE                   equ 0001h
C1FLTOBJ11T_EID16_LENGTH                 equ 0001h
C1FLTOBJ11T_EID16_MASK                   equ 0008h
C1FLTOBJ11T_EID17_POSN                   equ 0004h
C1FLTOBJ11T_EID17_POSITION               equ 0004h
C1FLTOBJ11T_EID17_SIZE                   equ 0001h
C1FLTOBJ11T_EID17_LENGTH                 equ 0001h
C1FLTOBJ11T_EID17_MASK                   equ 0010h

// Register: C1MASK11
#define C1MASK11 C1MASK11
C1MASK11                                 equ 01E8h

// Register: C1MASK11L
#define C1MASK11L C1MASK11L
C1MASK11L                                equ 01E8h
// bitfield definitions
C1MASK11L_MSID_POSN                      equ 0000h
C1MASK11L_MSID_POSITION                  equ 0000h
C1MASK11L_MSID_SIZE                      equ 0008h
C1MASK11L_MSID_LENGTH                    equ 0008h
C1MASK11L_MSID_MASK                      equ 00FFh
C1MASK11L_MSID0_POSN                     equ 0000h
C1MASK11L_MSID0_POSITION                 equ 0000h
C1MASK11L_MSID0_SIZE                     equ 0001h
C1MASK11L_MSID0_LENGTH                   equ 0001h
C1MASK11L_MSID0_MASK                     equ 0001h
C1MASK11L_MSID1_POSN                     equ 0001h
C1MASK11L_MSID1_POSITION                 equ 0001h
C1MASK11L_MSID1_SIZE                     equ 0001h
C1MASK11L_MSID1_LENGTH                   equ 0001h
C1MASK11L_MSID1_MASK                     equ 0002h
C1MASK11L_MSID2_POSN                     equ 0002h
C1MASK11L_MSID2_POSITION                 equ 0002h
C1MASK11L_MSID2_SIZE                     equ 0001h
C1MASK11L_MSID2_LENGTH                   equ 0001h
C1MASK11L_MSID2_MASK                     equ 0004h
C1MASK11L_MSID3_POSN                     equ 0003h
C1MASK11L_MSID3_POSITION                 equ 0003h
C1MASK11L_MSID3_SIZE                     equ 0001h
C1MASK11L_MSID3_LENGTH                   equ 0001h
C1MASK11L_MSID3_MASK                     equ 0008h
C1MASK11L_MSID4_POSN                     equ 0004h
C1MASK11L_MSID4_POSITION                 equ 0004h
C1MASK11L_MSID4_SIZE                     equ 0001h
C1MASK11L_MSID4_LENGTH                   equ 0001h
C1MASK11L_MSID4_MASK                     equ 0010h
C1MASK11L_MSID5_POSN                     equ 0005h
C1MASK11L_MSID5_POSITION                 equ 0005h
C1MASK11L_MSID5_SIZE                     equ 0001h
C1MASK11L_MSID5_LENGTH                   equ 0001h
C1MASK11L_MSID5_MASK                     equ 0020h
C1MASK11L_MSID6_POSN                     equ 0006h
C1MASK11L_MSID6_POSITION                 equ 0006h
C1MASK11L_MSID6_SIZE                     equ 0001h
C1MASK11L_MSID6_LENGTH                   equ 0001h
C1MASK11L_MSID6_MASK                     equ 0040h
C1MASK11L_MSID7_POSN                     equ 0007h
C1MASK11L_MSID7_POSITION                 equ 0007h
C1MASK11L_MSID7_SIZE                     equ 0001h
C1MASK11L_MSID7_LENGTH                   equ 0001h
C1MASK11L_MSID7_MASK                     equ 0080h

// Register: C1MASK11H
#define C1MASK11H C1MASK11H
C1MASK11H                                equ 01E9h
// bitfield definitions
C1MASK11H_MSID_POSN                      equ 0000h
C1MASK11H_MSID_POSITION                  equ 0000h
C1MASK11H_MSID_SIZE                      equ 0003h
C1MASK11H_MSID_LENGTH                    equ 0003h
C1MASK11H_MSID_MASK                      equ 0007h
C1MASK11H_MEID_POSN                      equ 0003h
C1MASK11H_MEID_POSITION                  equ 0003h
C1MASK11H_MEID_SIZE                      equ 0005h
C1MASK11H_MEID_LENGTH                    equ 0005h
C1MASK11H_MEID_MASK                      equ 00F8h
C1MASK11H_MSID8_POSN                     equ 0000h
C1MASK11H_MSID8_POSITION                 equ 0000h
C1MASK11H_MSID8_SIZE                     equ 0001h
C1MASK11H_MSID8_LENGTH                   equ 0001h
C1MASK11H_MSID8_MASK                     equ 0001h
C1MASK11H_MSID9_POSN                     equ 0001h
C1MASK11H_MSID9_POSITION                 equ 0001h
C1MASK11H_MSID9_SIZE                     equ 0001h
C1MASK11H_MSID9_LENGTH                   equ 0001h
C1MASK11H_MSID9_MASK                     equ 0002h
C1MASK11H_MSID10_POSN                    equ 0002h
C1MASK11H_MSID10_POSITION                equ 0002h
C1MASK11H_MSID10_SIZE                    equ 0001h
C1MASK11H_MSID10_LENGTH                  equ 0001h
C1MASK11H_MSID10_MASK                    equ 0004h
C1MASK11H_MEID0_POSN                     equ 0003h
C1MASK11H_MEID0_POSITION                 equ 0003h
C1MASK11H_MEID0_SIZE                     equ 0001h
C1MASK11H_MEID0_LENGTH                   equ 0001h
C1MASK11H_MEID0_MASK                     equ 0008h
C1MASK11H_MEID1_POSN                     equ 0004h
C1MASK11H_MEID1_POSITION                 equ 0004h
C1MASK11H_MEID1_SIZE                     equ 0001h
C1MASK11H_MEID1_LENGTH                   equ 0001h
C1MASK11H_MEID1_MASK                     equ 0010h
C1MASK11H_MEID2_POSN                     equ 0005h
C1MASK11H_MEID2_POSITION                 equ 0005h
C1MASK11H_MEID2_SIZE                     equ 0001h
C1MASK11H_MEID2_LENGTH                   equ 0001h
C1MASK11H_MEID2_MASK                     equ 0020h
C1MASK11H_MEID3_POSN                     equ 0006h
C1MASK11H_MEID3_POSITION                 equ 0006h
C1MASK11H_MEID3_SIZE                     equ 0001h
C1MASK11H_MEID3_LENGTH                   equ 0001h
C1MASK11H_MEID3_MASK                     equ 0040h
C1MASK11H_MEID4_POSN                     equ 0007h
C1MASK11H_MEID4_POSITION                 equ 0007h
C1MASK11H_MEID4_SIZE                     equ 0001h
C1MASK11H_MEID4_LENGTH                   equ 0001h
C1MASK11H_MEID4_MASK                     equ 0080h

// Register: C1MASK11U
#define C1MASK11U C1MASK11U
C1MASK11U                                equ 01EAh
// bitfield definitions
C1MASK11U_MEID_POSN                      equ 0000h
C1MASK11U_MEID_POSITION                  equ 0000h
C1MASK11U_MEID_SIZE                      equ 0008h
C1MASK11U_MEID_LENGTH                    equ 0008h
C1MASK11U_MEID_MASK                      equ 00FFh
C1MASK11U_MEID5_POSN                     equ 0000h
C1MASK11U_MEID5_POSITION                 equ 0000h
C1MASK11U_MEID5_SIZE                     equ 0001h
C1MASK11U_MEID5_LENGTH                   equ 0001h
C1MASK11U_MEID5_MASK                     equ 0001h
C1MASK11U_MEID6_POSN                     equ 0001h
C1MASK11U_MEID6_POSITION                 equ 0001h
C1MASK11U_MEID6_SIZE                     equ 0001h
C1MASK11U_MEID6_LENGTH                   equ 0001h
C1MASK11U_MEID6_MASK                     equ 0002h
C1MASK11U_MEID7_POSN                     equ 0002h
C1MASK11U_MEID7_POSITION                 equ 0002h
C1MASK11U_MEID7_SIZE                     equ 0001h
C1MASK11U_MEID7_LENGTH                   equ 0001h
C1MASK11U_MEID7_MASK                     equ 0004h
C1MASK11U_MEID8_POSN                     equ 0003h
C1MASK11U_MEID8_POSITION                 equ 0003h
C1MASK11U_MEID8_SIZE                     equ 0001h
C1MASK11U_MEID8_LENGTH                   equ 0001h
C1MASK11U_MEID8_MASK                     equ 0008h
C1MASK11U_MEID9_POSN                     equ 0004h
C1MASK11U_MEID9_POSITION                 equ 0004h
C1MASK11U_MEID9_SIZE                     equ 0001h
C1MASK11U_MEID9_LENGTH                   equ 0001h
C1MASK11U_MEID9_MASK                     equ 0010h
C1MASK11U_MEID10_POSN                    equ 0005h
C1MASK11U_MEID10_POSITION                equ 0005h
C1MASK11U_MEID10_SIZE                    equ 0001h
C1MASK11U_MEID10_LENGTH                  equ 0001h
C1MASK11U_MEID10_MASK                    equ 0020h
C1MASK11U_MEID11_POSN                    equ 0006h
C1MASK11U_MEID11_POSITION                equ 0006h
C1MASK11U_MEID11_SIZE                    equ 0001h
C1MASK11U_MEID11_LENGTH                  equ 0001h
C1MASK11U_MEID11_MASK                    equ 0040h
C1MASK11U_MEID12_POSN                    equ 0007h
C1MASK11U_MEID12_POSITION                equ 0007h
C1MASK11U_MEID12_SIZE                    equ 0001h
C1MASK11U_MEID12_LENGTH                  equ 0001h
C1MASK11U_MEID12_MASK                    equ 0080h

// Register: C1MASK11T
#define C1MASK11T C1MASK11T
C1MASK11T                                equ 01EBh
// bitfield definitions
C1MASK11T_MEID_POSN                      equ 0000h
C1MASK11T_MEID_POSITION                  equ 0000h
C1MASK11T_MEID_SIZE                      equ 0005h
C1MASK11T_MEID_LENGTH                    equ 0005h
C1MASK11T_MEID_MASK                      equ 001Fh
C1MASK11T_MSID11_POSN                    equ 0005h
C1MASK11T_MSID11_POSITION                equ 0005h
C1MASK11T_MSID11_SIZE                    equ 0001h
C1MASK11T_MSID11_LENGTH                  equ 0001h
C1MASK11T_MSID11_MASK                    equ 0020h
C1MASK11T_MIDE_POSN                      equ 0006h
C1MASK11T_MIDE_POSITION                  equ 0006h
C1MASK11T_MIDE_SIZE                      equ 0001h
C1MASK11T_MIDE_LENGTH                    equ 0001h
C1MASK11T_MIDE_MASK                      equ 0040h
C1MASK11T_MEID13_POSN                    equ 0000h
C1MASK11T_MEID13_POSITION                equ 0000h
C1MASK11T_MEID13_SIZE                    equ 0001h
C1MASK11T_MEID13_LENGTH                  equ 0001h
C1MASK11T_MEID13_MASK                    equ 0001h
C1MASK11T_MEID14_POSN                    equ 0001h
C1MASK11T_MEID14_POSITION                equ 0001h
C1MASK11T_MEID14_SIZE                    equ 0001h
C1MASK11T_MEID14_LENGTH                  equ 0001h
C1MASK11T_MEID14_MASK                    equ 0002h
C1MASK11T_MEID15_POSN                    equ 0002h
C1MASK11T_MEID15_POSITION                equ 0002h
C1MASK11T_MEID15_SIZE                    equ 0001h
C1MASK11T_MEID15_LENGTH                  equ 0001h
C1MASK11T_MEID15_MASK                    equ 0004h
C1MASK11T_MEID16_POSN                    equ 0003h
C1MASK11T_MEID16_POSITION                equ 0003h
C1MASK11T_MEID16_SIZE                    equ 0001h
C1MASK11T_MEID16_LENGTH                  equ 0001h
C1MASK11T_MEID16_MASK                    equ 0008h
C1MASK11T_MEID17_POSN                    equ 0004h
C1MASK11T_MEID17_POSITION                equ 0004h
C1MASK11T_MEID17_SIZE                    equ 0001h
C1MASK11T_MEID17_LENGTH                  equ 0001h
C1MASK11T_MEID17_MASK                    equ 0010h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 0200h
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0201h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0202h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0203h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h

