GopalSaraf/Practicals/PSDL/include/proc/pic18f27q84.inc
// Register: T5GATE
#define T5GATE T5GATE
T5GATE                                   equ 0338h
// bitfield definitions
T5GATE_GSS_POSN                          equ 0000h
T5GATE_GSS_POSITION                      equ 0000h
T5GATE_GSS_SIZE                          equ 0008h
T5GATE_GSS_LENGTH                        equ 0008h
T5GATE_GSS_MASK                          equ 00FFh
T5GATE_GSS0_POSN                         equ 0000h
T5GATE_GSS0_POSITION                     equ 0000h
T5GATE_GSS0_SIZE                         equ 0001h
T5GATE_GSS0_LENGTH                       equ 0001h
T5GATE_GSS0_MASK                         equ 0001h
T5GATE_GSS1_POSN                         equ 0001h
T5GATE_GSS1_POSITION                     equ 0001h
T5GATE_GSS1_SIZE                         equ 0001h
T5GATE_GSS1_LENGTH                       equ 0001h
T5GATE_GSS1_MASK                         equ 0002h
T5GATE_GSS2_POSN                         equ 0002h
T5GATE_GSS2_POSITION                     equ 0002h
T5GATE_GSS2_SIZE                         equ 0001h
T5GATE_GSS2_LENGTH                       equ 0001h
T5GATE_GSS2_MASK                         equ 0004h
T5GATE_GSS3_POSN                         equ 0003h
T5GATE_GSS3_POSITION                     equ 0003h
T5GATE_GSS3_SIZE                         equ 0001h
T5GATE_GSS3_LENGTH                       equ 0001h
T5GATE_GSS3_MASK                         equ 0008h
T5GATE_GSS4_POSN                         equ 0004h
T5GATE_GSS4_POSITION                     equ 0004h
T5GATE_GSS4_SIZE                         equ 0001h
T5GATE_GSS4_LENGTH                       equ 0001h
T5GATE_GSS4_MASK                         equ 0010h
T5GATE_T5GSS0_POSN                       equ 0000h
T5GATE_T5GSS0_POSITION                   equ 0000h
T5GATE_T5GSS0_SIZE                       equ 0001h
T5GATE_T5GSS0_LENGTH                     equ 0001h
T5GATE_T5GSS0_MASK                       equ 0001h
T5GATE_T5GSS1_POSN                       equ 0001h
T5GATE_T5GSS1_POSITION                   equ 0001h
T5GATE_T5GSS1_SIZE                       equ 0001h
T5GATE_T5GSS1_LENGTH                     equ 0001h
T5GATE_T5GSS1_MASK                       equ 0002h
T5GATE_T5GSS2_POSN                       equ 0002h
T5GATE_T5GSS2_POSITION                   equ 0002h
T5GATE_T5GSS2_SIZE                       equ 0001h
T5GATE_T5GSS2_LENGTH                     equ 0001h
T5GATE_T5GSS2_MASK                       equ 0004h
T5GATE_T5GSS3_POSN                       equ 0003h
T5GATE_T5GSS3_POSITION                   equ 0003h
T5GATE_T5GSS3_SIZE                       equ 0001h
T5GATE_T5GSS3_LENGTH                     equ 0001h
T5GATE_T5GSS3_MASK                       equ 0008h
T5GATE_T5GSS4_POSN                       equ 0004h
T5GATE_T5GSS4_POSITION                   equ 0004h
T5GATE_T5GSS4_SIZE                       equ 0001h
T5GATE_T5GSS4_LENGTH                     equ 0001h
T5GATE_T5GSS4_MASK                       equ 0010h

// Register: T5CLK
#define T5CLK T5CLK
T5CLK                                    equ 0339h
// bitfield definitions
T5CLK_CS_POSN                            equ 0000h
T5CLK_CS_POSITION                        equ 0000h
T5CLK_CS_SIZE                            equ 0008h
T5CLK_CS_LENGTH                          equ 0008h
T5CLK_CS_MASK                            equ 00FFh
T5CLK_T5CS0_POSN                         equ 0000h
T5CLK_T5CS0_POSITION                     equ 0000h
T5CLK_T5CS0_SIZE                         equ 0001h
T5CLK_T5CS0_LENGTH                       equ 0001h
T5CLK_T5CS0_MASK                         equ 0001h
T5CLK_T5CS1_POSN                         equ 0001h
T5CLK_T5CS1_POSITION                     equ 0001h
T5CLK_T5CS1_SIZE                         equ 0001h
T5CLK_T5CS1_LENGTH                       equ 0001h
T5CLK_T5CS1_MASK                         equ 0002h
T5CLK_T5CS2_POSN                         equ 0002h
T5CLK_T5CS2_POSITION                     equ 0002h
T5CLK_T5CS2_SIZE                         equ 0001h
T5CLK_T5CS2_LENGTH                       equ 0001h
T5CLK_T5CS2_MASK                         equ 0004h
T5CLK_T5CS3_POSN                         equ 0003h
T5CLK_T5CS3_POSITION                     equ 0003h
T5CLK_T5CS3_SIZE                         equ 0001h
T5CLK_T5CS3_LENGTH                       equ 0001h
T5CLK_T5CS3_MASK                         equ 0008h
T5CLK_T5CS4_POSN                         equ 0004h
T5CLK_T5CS4_POSITION                     equ 0004h
T5CLK_T5CS4_SIZE                         equ 0001h
T5CLK_T5CS4_LENGTH                       equ 0001h
T5CLK_T5CS4_MASK                         equ 0010h
T5CLK_CS0_POSN                           equ 0000h
T5CLK_CS0_POSITION                       equ 0000h
T5CLK_CS0_SIZE                           equ 0001h
T5CLK_CS0_LENGTH                         equ 0001h
T5CLK_CS0_MASK                           equ 0001h
T5CLK_CS1_POSN                           equ 0001h
T5CLK_CS1_POSITION                       equ 0001h
T5CLK_CS1_SIZE                           equ 0001h
T5CLK_CS1_LENGTH                         equ 0001h
T5CLK_CS1_MASK                           equ 0002h
T5CLK_CS2_POSN                           equ 0002h
T5CLK_CS2_POSITION                       equ 0002h
T5CLK_CS2_SIZE                           equ 0001h
T5CLK_CS2_LENGTH                         equ 0001h
T5CLK_CS2_MASK                           equ 0004h
T5CLK_CS3_POSN                           equ 0003h
T5CLK_CS3_POSITION                       equ 0003h
T5CLK_CS3_SIZE                           equ 0001h
T5CLK_CS3_LENGTH                         equ 0001h
T5CLK_CS3_MASK                           equ 0008h
T5CLK_CS4_POSN                           equ 0004h
T5CLK_CS4_POSITION                       equ 0004h
T5CLK_CS4_SIZE                           equ 0001h
T5CLK_CS4_LENGTH                         equ 0001h
T5CLK_CS4_MASK                           equ 0010h

// Register: T6TMR
#define T6TMR T6TMR
T6TMR                                    equ 033Ah
// bitfield definitions
T6TMR_TMR6_POSN                          equ 0000h
T6TMR_TMR6_POSITION                      equ 0000h
T6TMR_TMR6_SIZE                          equ 0008h
T6TMR_TMR6_LENGTH                        equ 0008h
T6TMR_TMR6_MASK                          equ 00FFh

// Register: T6PR
#define T6PR T6PR
T6PR                                     equ 033Bh
// bitfield definitions
T6PR_PR6_POSN                            equ 0000h
T6PR_PR6_POSITION                        equ 0000h
T6PR_PR6_SIZE                            equ 0008h
T6PR_PR6_LENGTH                          equ 0008h
T6PR_PR6_MASK                            equ 00FFh

// Register: T6CON
#define T6CON T6CON
T6CON                                    equ 033Ch
// bitfield definitions
T6CON_OUTPS_POSN                         equ 0000h
T6CON_OUTPS_POSITION                     equ 0000h
T6CON_OUTPS_SIZE                         equ 0004h
T6CON_OUTPS_LENGTH                       equ 0004h
T6CON_OUTPS_MASK                         equ 000Fh
T6CON_CKPS_POSN                          equ 0004h
T6CON_CKPS_POSITION                      equ 0004h
T6CON_CKPS_SIZE                          equ 0003h
T6CON_CKPS_LENGTH                        equ 0003h
T6CON_CKPS_MASK                          equ 0070h
T6CON_ON_POSN                            equ 0007h
T6CON_ON_POSITION                        equ 0007h
T6CON_ON_SIZE                            equ 0001h
T6CON_ON_LENGTH                          equ 0001h
T6CON_ON_MASK                            equ 0080h
T6CON_T6OUTPS_POSN                       equ 0000h
T6CON_T6OUTPS_POSITION                   equ 0000h
T6CON_T6OUTPS_SIZE                       equ 0004h
T6CON_T6OUTPS_LENGTH                     equ 0004h
T6CON_T6OUTPS_MASK                       equ 000Fh
T6CON_T6CKPS_POSN                        equ 0004h
T6CON_T6CKPS_POSITION                    equ 0004h
T6CON_T6CKPS_SIZE                        equ 0003h
T6CON_T6CKPS_LENGTH                      equ 0003h
T6CON_T6CKPS_MASK                        equ 0070h
T6CON_T6ON_POSN                          equ 0007h
T6CON_T6ON_POSITION                      equ 0007h
T6CON_T6ON_SIZE                          equ 0001h
T6CON_T6ON_LENGTH                        equ 0001h
T6CON_T6ON_MASK                          equ 0080h
T6CON_T6OUTPS0_POSN                      equ 0000h
T6CON_T6OUTPS0_POSITION                  equ 0000h
T6CON_T6OUTPS0_SIZE                      equ 0001h
T6CON_T6OUTPS0_LENGTH                    equ 0001h
T6CON_T6OUTPS0_MASK                      equ 0001h
T6CON_T6OUTPS1_POSN                      equ 0001h
T6CON_T6OUTPS1_POSITION                  equ 0001h
T6CON_T6OUTPS1_SIZE                      equ 0001h
T6CON_T6OUTPS1_LENGTH                    equ 0001h
T6CON_T6OUTPS1_MASK                      equ 0002h
T6CON_T6OUTPS2_POSN                      equ 0002h
T6CON_T6OUTPS2_POSITION                  equ 0002h
T6CON_T6OUTPS2_SIZE                      equ 0001h
T6CON_T6OUTPS2_LENGTH                    equ 0001h
T6CON_T6OUTPS2_MASK                      equ 0004h
T6CON_T6OUTPS3_POSN                      equ 0003h
T6CON_T6OUTPS3_POSITION                  equ 0003h
T6CON_T6OUTPS3_SIZE                      equ 0001h
T6CON_T6OUTPS3_LENGTH                    equ 0001h
T6CON_T6OUTPS3_MASK                      equ 0008h
T6CON_T6CKPS0_POSN                       equ 0004h
T6CON_T6CKPS0_POSITION                   equ 0004h
T6CON_T6CKPS0_SIZE                       equ 0001h
T6CON_T6CKPS0_LENGTH                     equ 0001h
T6CON_T6CKPS0_MASK                       equ 0010h
T6CON_T6CKPS1_POSN                       equ 0005h
T6CON_T6CKPS1_POSITION                   equ 0005h
T6CON_T6CKPS1_SIZE                       equ 0001h
T6CON_T6CKPS1_LENGTH                     equ 0001h
T6CON_T6CKPS1_MASK                       equ 0020h
T6CON_T6CKPS2_POSN                       equ 0006h
T6CON_T6CKPS2_POSITION                   equ 0006h
T6CON_T6CKPS2_SIZE                       equ 0001h
T6CON_T6CKPS2_LENGTH                     equ 0001h
T6CON_T6CKPS2_MASK                       equ 0040h
T6CON_OUTPS0_POSN                        equ 0000h
T6CON_OUTPS0_POSITION                    equ 0000h
T6CON_OUTPS0_SIZE                        equ 0001h
T6CON_OUTPS0_LENGTH                      equ 0001h
T6CON_OUTPS0_MASK                        equ 0001h
T6CON_OUTPS1_POSN                        equ 0001h
T6CON_OUTPS1_POSITION                    equ 0001h
T6CON_OUTPS1_SIZE                        equ 0001h
T6CON_OUTPS1_LENGTH                      equ 0001h
T6CON_OUTPS1_MASK                        equ 0002h
T6CON_OUTPS2_POSN                        equ 0002h
T6CON_OUTPS2_POSITION                    equ 0002h
T6CON_OUTPS2_SIZE                        equ 0001h
T6CON_OUTPS2_LENGTH                      equ 0001h
T6CON_OUTPS2_MASK                        equ 0004h
T6CON_OUTPS3_POSN                        equ 0003h
T6CON_OUTPS3_POSITION                    equ 0003h
T6CON_OUTPS3_SIZE                        equ 0001h
T6CON_OUTPS3_LENGTH                      equ 0001h
T6CON_OUTPS3_MASK                        equ 0008h
T6CON_CKPS0_POSN                         equ 0004h
T6CON_CKPS0_POSITION                     equ 0004h
T6CON_CKPS0_SIZE                         equ 0001h
T6CON_CKPS0_LENGTH                       equ 0001h
T6CON_CKPS0_MASK                         equ 0010h
T6CON_CKPS1_POSN                         equ 0005h
T6CON_CKPS1_POSITION                     equ 0005h
T6CON_CKPS1_SIZE                         equ 0001h
T6CON_CKPS1_LENGTH                       equ 0001h
T6CON_CKPS1_MASK                         equ 0020h
T6CON_CKPS2_POSN                         equ 0006h
T6CON_CKPS2_POSITION                     equ 0006h
T6CON_CKPS2_SIZE                         equ 0001h
T6CON_CKPS2_LENGTH                       equ 0001h
T6CON_CKPS2_MASK                         equ 0040h
T6CON_TMR6ON_POSN                        equ 0007h
T6CON_TMR6ON_POSITION                    equ 0007h
T6CON_TMR6ON_SIZE                        equ 0001h
T6CON_TMR6ON_LENGTH                      equ 0001h
T6CON_TMR6ON_MASK                        equ 0080h

// Register: T6HLT
#define T6HLT T6HLT
T6HLT                                    equ 033Dh
// bitfield definitions
T6HLT_MODE_POSN                          equ 0000h
T6HLT_MODE_POSITION                      equ 0000h
T6HLT_MODE_SIZE                          equ 0005h
T6HLT_MODE_LENGTH                        equ 0005h
T6HLT_MODE_MASK                          equ 001Fh
T6HLT_CKSYNC_POSN                        equ 0005h
T6HLT_CKSYNC_POSITION                    equ 0005h
T6HLT_CKSYNC_SIZE                        equ 0001h
T6HLT_CKSYNC_LENGTH                      equ 0001h
T6HLT_CKSYNC_MASK                        equ 0020h
T6HLT_CKPOL_POSN                         equ 0006h
T6HLT_CKPOL_POSITION                     equ 0006h
T6HLT_CKPOL_SIZE                         equ 0001h
T6HLT_CKPOL_LENGTH                       equ 0001h
T6HLT_CKPOL_MASK                         equ 0040h
T6HLT_PSYNC_POSN                         equ 0007h
T6HLT_PSYNC_POSITION                     equ 0007h
T6HLT_PSYNC_SIZE                         equ 0001h
T6HLT_PSYNC_LENGTH                       equ 0001h
T6HLT_PSYNC_MASK                         equ 0080h
T6HLT_MODE0_POSN                         equ 0000h
T6HLT_MODE0_POSITION                     equ 0000h
T6HLT_MODE0_SIZE                         equ 0001h
T6HLT_MODE0_LENGTH                       equ 0001h
T6HLT_MODE0_MASK                         equ 0001h
T6HLT_MODE1_POSN                         equ 0001h
T6HLT_MODE1_POSITION                     equ 0001h
T6HLT_MODE1_SIZE                         equ 0001h
T6HLT_MODE1_LENGTH                       equ 0001h
T6HLT_MODE1_MASK                         equ 0002h
T6HLT_MODE2_POSN                         equ 0002h
T6HLT_MODE2_POSITION                     equ 0002h
T6HLT_MODE2_SIZE                         equ 0001h
T6HLT_MODE2_LENGTH                       equ 0001h
T6HLT_MODE2_MASK                         equ 0004h
T6HLT_MODE3_POSN                         equ 0003h
T6HLT_MODE3_POSITION                     equ 0003h
T6HLT_MODE3_SIZE                         equ 0001h
T6HLT_MODE3_LENGTH                       equ 0001h
T6HLT_MODE3_MASK                         equ 0008h
T6HLT_MODE4_POSN                         equ 0004h
T6HLT_MODE4_POSITION                     equ 0004h
T6HLT_MODE4_SIZE                         equ 0001h
T6HLT_MODE4_LENGTH                       equ 0001h
T6HLT_MODE4_MASK                         equ 0010h
T6HLT_T6MODE_POSN                        equ 0000h
T6HLT_T6MODE_POSITION                    equ 0000h
T6HLT_T6MODE_SIZE                        equ 0005h
T6HLT_T6MODE_LENGTH                      equ 0005h
T6HLT_T6MODE_MASK                        equ 001Fh
T6HLT_T6CKSYNC_POSN                      equ 0005h
T6HLT_T6CKSYNC_POSITION                  equ 0005h
T6HLT_T6CKSYNC_SIZE                      equ 0001h
T6HLT_T6CKSYNC_LENGTH                    equ 0001h
T6HLT_T6CKSYNC_MASK                      equ 0020h
T6HLT_T6CKPOL_POSN                       equ 0006h
T6HLT_T6CKPOL_POSITION                   equ 0006h
T6HLT_T6CKPOL_SIZE                       equ 0001h
T6HLT_T6CKPOL_LENGTH                     equ 0001h
T6HLT_T6CKPOL_MASK                       equ 0040h
T6HLT_T6PSYNC_POSN                       equ 0007h
T6HLT_T6PSYNC_POSITION                   equ 0007h
T6HLT_T6PSYNC_SIZE                       equ 0001h
T6HLT_T6PSYNC_LENGTH                     equ 0001h
T6HLT_T6PSYNC_MASK                       equ 0080h
T6HLT_T6MODE0_POSN                       equ 0000h
T6HLT_T6MODE0_POSITION                   equ 0000h
T6HLT_T6MODE0_SIZE                       equ 0001h
T6HLT_T6MODE0_LENGTH                     equ 0001h
T6HLT_T6MODE0_MASK                       equ 0001h
T6HLT_T6MODE1_POSN                       equ 0001h
T6HLT_T6MODE1_POSITION                   equ 0001h
T6HLT_T6MODE1_SIZE                       equ 0001h
T6HLT_T6MODE1_LENGTH                     equ 0001h
T6HLT_T6MODE1_MASK                       equ 0002h
T6HLT_T6MODE2_POSN                       equ 0002h
T6HLT_T6MODE2_POSITION                   equ 0002h
T6HLT_T6MODE2_SIZE                       equ 0001h
T6HLT_T6MODE2_LENGTH                     equ 0001h
T6HLT_T6MODE2_MASK                       equ 0004h
T6HLT_T6MODE3_POSN                       equ 0003h
T6HLT_T6MODE3_POSITION                   equ 0003h
T6HLT_T6MODE3_SIZE                       equ 0001h
T6HLT_T6MODE3_LENGTH                     equ 0001h
T6HLT_T6MODE3_MASK                       equ 0008h
T6HLT_T6MODE4_POSN                       equ 0004h
T6HLT_T6MODE4_POSITION                   equ 0004h
T6HLT_T6MODE4_SIZE                       equ 0001h
T6HLT_T6MODE4_LENGTH                     equ 0001h
T6HLT_T6MODE4_MASK                       equ 0010h

// Register: T6CLKCON
#define T6CLKCON T6CLKCON
T6CLKCON                                 equ 033Eh
// bitfield definitions
T6CLKCON_CS_POSN                         equ 0000h
T6CLKCON_CS_POSITION                     equ 0000h
T6CLKCON_CS_SIZE                         equ 0004h
T6CLKCON_CS_LENGTH                       equ 0004h
T6CLKCON_CS_MASK                         equ 000Fh
T6CLKCON_CS0_POSN                        equ 0000h
T6CLKCON_CS0_POSITION                    equ 0000h
T6CLKCON_CS0_SIZE                        equ 0001h
T6CLKCON_CS0_LENGTH                      equ 0001h
T6CLKCON_CS0_MASK                        equ 0001h
T6CLKCON_CS1_POSN                        equ 0001h
T6CLKCON_CS1_POSITION                    equ 0001h
T6CLKCON_CS1_SIZE                        equ 0001h
T6CLKCON_CS1_LENGTH                      equ 0001h
T6CLKCON_CS1_MASK                        equ 0002h
T6CLKCON_CS2_POSN                        equ 0002h
T6CLKCON_CS2_POSITION                    equ 0002h
T6CLKCON_CS2_SIZE                        equ 0001h
T6CLKCON_CS2_LENGTH                      equ 0001h
T6CLKCON_CS2_MASK                        equ 0004h
T6CLKCON_CS3_POSN                        equ 0003h
T6CLKCON_CS3_POSITION                    equ 0003h
T6CLKCON_CS3_SIZE                        equ 0001h
T6CLKCON_CS3_LENGTH                      equ 0001h
T6CLKCON_CS3_MASK                        equ 0008h
T6CLKCON_T6CS_POSN                       equ 0000h
T6CLKCON_T6CS_POSITION                   equ 0000h
T6CLKCON_T6CS_SIZE                       equ 0004h
T6CLKCON_T6CS_LENGTH                     equ 0004h
T6CLKCON_T6CS_MASK                       equ 000Fh
T6CLKCON_T6CS0_POSN                      equ 0000h
T6CLKCON_T6CS0_POSITION                  equ 0000h
T6CLKCON_T6CS0_SIZE                      equ 0001h
T6CLKCON_T6CS0_LENGTH                    equ 0001h
T6CLKCON_T6CS0_MASK                      equ 0001h
T6CLKCON_T6CS1_POSN                      equ 0001h
T6CLKCON_T6CS1_POSITION                  equ 0001h
T6CLKCON_T6CS1_SIZE                      equ 0001h
T6CLKCON_T6CS1_LENGTH                    equ 0001h
T6CLKCON_T6CS1_MASK                      equ 0002h
T6CLKCON_T6CS2_POSN                      equ 0002h
T6CLKCON_T6CS2_POSITION                  equ 0002h
T6CLKCON_T6CS2_SIZE                      equ 0001h
T6CLKCON_T6CS2_LENGTH                    equ 0001h
T6CLKCON_T6CS2_MASK                      equ 0004h
T6CLKCON_T6CS3_POSN                      equ 0003h
T6CLKCON_T6CS3_POSITION                  equ 0003h
T6CLKCON_T6CS3_SIZE                      equ 0001h
T6CLKCON_T6CS3_LENGTH                    equ 0001h
T6CLKCON_T6CS3_MASK                      equ 0008h

// Register: T6RST
#define T6RST T6RST
T6RST                                    equ 033Fh
// bitfield definitions
T6RST_RSEL_POSN                          equ 0000h
T6RST_RSEL_POSITION                      equ 0000h
T6RST_RSEL_SIZE                          equ 0005h
T6RST_RSEL_LENGTH                        equ 0005h
T6RST_RSEL_MASK                          equ 001Fh
T6RST_RSEL0_POSN                         equ 0000h
T6RST_RSEL0_POSITION                     equ 0000h
T6RST_RSEL0_SIZE                         equ 0001h
T6RST_RSEL0_LENGTH                       equ 0001h
T6RST_RSEL0_MASK                         equ 0001h
T6RST_RSEL1_POSN                         equ 0001h
T6RST_RSEL1_POSITION                     equ 0001h
T6RST_RSEL1_SIZE                         equ 0001h
T6RST_RSEL1_LENGTH                       equ 0001h
T6RST_RSEL1_MASK                         equ 0002h
T6RST_RSEL2_POSN                         equ 0002h
T6RST_RSEL2_POSITION                     equ 0002h
T6RST_RSEL2_SIZE                         equ 0001h
T6RST_RSEL2_LENGTH                       equ 0001h
T6RST_RSEL2_MASK                         equ 0004h
T6RST_RSEL3_POSN                         equ 0003h
T6RST_RSEL3_POSITION                     equ 0003h
T6RST_RSEL3_SIZE                         equ 0001h
T6RST_RSEL3_LENGTH                       equ 0001h
T6RST_RSEL3_MASK                         equ 0008h
T6RST_RSEL4_POSN                         equ 0004h
T6RST_RSEL4_POSITION                     equ 0004h
T6RST_RSEL4_SIZE                         equ 0001h
T6RST_RSEL4_LENGTH                       equ 0001h
T6RST_RSEL4_MASK                         equ 0010h
T6RST_T6RSEL_POSN                        equ 0000h
T6RST_T6RSEL_POSITION                    equ 0000h
T6RST_T6RSEL_SIZE                        equ 0005h
T6RST_T6RSEL_LENGTH                      equ 0005h
T6RST_T6RSEL_MASK                        equ 001Fh
T6RST_T6RSEL0_POSN                       equ 0000h
T6RST_T6RSEL0_POSITION                   equ 0000h
T6RST_T6RSEL0_SIZE                       equ 0001h
T6RST_T6RSEL0_LENGTH                     equ 0001h
T6RST_T6RSEL0_MASK                       equ 0001h
T6RST_T6RSEL1_POSN                       equ 0001h
T6RST_T6RSEL1_POSITION                   equ 0001h
T6RST_T6RSEL1_SIZE                       equ 0001h
T6RST_T6RSEL1_LENGTH                     equ 0001h
T6RST_T6RSEL1_MASK                       equ 0002h
T6RST_T6RSEL2_POSN                       equ 0002h
T6RST_T6RSEL2_POSITION                   equ 0002h
T6RST_T6RSEL2_SIZE                       equ 0001h
T6RST_T6RSEL2_LENGTH                     equ 0001h
T6RST_T6RSEL2_MASK                       equ 0004h
T6RST_T6RSEL3_POSN                       equ 0003h
T6RST_T6RSEL3_POSITION                   equ 0003h
T6RST_T6RSEL3_SIZE                       equ 0001h
T6RST_T6RSEL3_LENGTH                     equ 0001h
T6RST_T6RSEL3_MASK                       equ 0008h
T6RST_T6RSEL4_POSN                       equ 0004h
T6RST_T6RSEL4_POSITION                   equ 0004h
T6RST_T6RSEL4_SIZE                       equ 0001h
T6RST_T6RSEL4_LENGTH                     equ 0001h
T6RST_T6RSEL4_MASK                       equ 0010h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0340h

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0340h
// bitfield definitions
CCPR1L_RL_POSN                           equ 0000h
CCPR1L_RL_POSITION                       equ 0000h
CCPR1L_RL_SIZE                           equ 0008h
CCPR1L_RL_LENGTH                         equ 0008h
CCPR1L_RL_MASK                           equ 00FFh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0341h
// bitfield definitions
CCPR1H_RH_POSN                           equ 0000h
CCPR1H_RH_POSITION                       equ 0000h
CCPR1H_RH_SIZE                           equ 0008h
CCPR1H_RH_LENGTH                         equ 0008h
CCPR1H_RH_MASK                           equ 00FFh

