GopalSaraf/Practicals/PSDL/include/proc/pic18f27q84.inc
// Register: NCO2INCU
#define NCO2INCU NCO2INCU
NCO2INCU                                 equ 044Dh
// bitfield definitions
NCO2INCU_INC_POSN                        equ 0000h
NCO2INCU_INC_POSITION                    equ 0000h
NCO2INCU_INC_SIZE                        equ 0004h
NCO2INCU_INC_LENGTH                      equ 0004h
NCO2INCU_INC_MASK                        equ 000Fh
NCO2INCU_NCO2INC16_POSN                  equ 0000h
NCO2INCU_NCO2INC16_POSITION              equ 0000h
NCO2INCU_NCO2INC16_SIZE                  equ 0001h
NCO2INCU_NCO2INC16_LENGTH                equ 0001h
NCO2INCU_NCO2INC16_MASK                  equ 0001h
NCO2INCU_NCO2INC17_POSN                  equ 0001h
NCO2INCU_NCO2INC17_POSITION              equ 0001h
NCO2INCU_NCO2INC17_SIZE                  equ 0001h
NCO2INCU_NCO2INC17_LENGTH                equ 0001h
NCO2INCU_NCO2INC17_MASK                  equ 0002h
NCO2INCU_NCO2INC18_POSN                  equ 0002h
NCO2INCU_NCO2INC18_POSITION              equ 0002h
NCO2INCU_NCO2INC18_SIZE                  equ 0001h
NCO2INCU_NCO2INC18_LENGTH                equ 0001h
NCO2INCU_NCO2INC18_MASK                  equ 0004h
NCO2INCU_NCO2INC19_POSN                  equ 0003h
NCO2INCU_NCO2INC19_POSITION              equ 0003h
NCO2INCU_NCO2INC19_SIZE                  equ 0001h
NCO2INCU_NCO2INC19_LENGTH                equ 0001h
NCO2INCU_NCO2INC19_MASK                  equ 0008h
NCO2INCU_INC16_POSN                      equ 0000h
NCO2INCU_INC16_POSITION                  equ 0000h
NCO2INCU_INC16_SIZE                      equ 0001h
NCO2INCU_INC16_LENGTH                    equ 0001h
NCO2INCU_INC16_MASK                      equ 0001h
NCO2INCU_INC17_POSN                      equ 0001h
NCO2INCU_INC17_POSITION                  equ 0001h
NCO2INCU_INC17_SIZE                      equ 0001h
NCO2INCU_INC17_LENGTH                    equ 0001h
NCO2INCU_INC17_MASK                      equ 0002h
NCO2INCU_INC18_POSN                      equ 0002h
NCO2INCU_INC18_POSITION                  equ 0002h
NCO2INCU_INC18_SIZE                      equ 0001h
NCO2INCU_INC18_LENGTH                    equ 0001h
NCO2INCU_INC18_MASK                      equ 0004h
NCO2INCU_INC19_POSN                      equ 0003h
NCO2INCU_INC19_POSITION                  equ 0003h
NCO2INCU_INC19_SIZE                      equ 0001h
NCO2INCU_INC19_LENGTH                    equ 0001h
NCO2INCU_INC19_MASK                      equ 0008h
NCO2INCU_NCO2INC_POSN                    equ 0000h
NCO2INCU_NCO2INC_POSITION                equ 0000h
NCO2INCU_NCO2INC_SIZE                    equ 0004h
NCO2INCU_NCO2INC_LENGTH                  equ 0004h
NCO2INCU_NCO2INC_MASK                    equ 000Fh

// Register: NCO2CON
#define NCO2CON NCO2CON
NCO2CON                                  equ 044Eh
// bitfield definitions
NCO2CON_PFM_POSN                         equ 0000h
NCO2CON_PFM_POSITION                     equ 0000h
NCO2CON_PFM_SIZE                         equ 0001h
NCO2CON_PFM_LENGTH                       equ 0001h
NCO2CON_PFM_MASK                         equ 0001h
NCO2CON_POL_POSN                         equ 0004h
NCO2CON_POL_POSITION                     equ 0004h
NCO2CON_POL_SIZE                         equ 0001h
NCO2CON_POL_LENGTH                       equ 0001h
NCO2CON_POL_MASK                         equ 0010h
NCO2CON_OUT_POSN                         equ 0005h
NCO2CON_OUT_POSITION                     equ 0005h
NCO2CON_OUT_SIZE                         equ 0001h
NCO2CON_OUT_LENGTH                       equ 0001h
NCO2CON_OUT_MASK                         equ 0020h
NCO2CON_EN_POSN                          equ 0007h
NCO2CON_EN_POSITION                      equ 0007h
NCO2CON_EN_SIZE                          equ 0001h
NCO2CON_EN_LENGTH                        equ 0001h
NCO2CON_EN_MASK                          equ 0080h
NCO2CON_NCO2PFM_POSN                     equ 0000h
NCO2CON_NCO2PFM_POSITION                 equ 0000h
NCO2CON_NCO2PFM_SIZE                     equ 0001h
NCO2CON_NCO2PFM_LENGTH                   equ 0001h
NCO2CON_NCO2PFM_MASK                     equ 0001h
NCO2CON_NCO2POL_POSN                     equ 0004h
NCO2CON_NCO2POL_POSITION                 equ 0004h
NCO2CON_NCO2POL_SIZE                     equ 0001h
NCO2CON_NCO2POL_LENGTH                   equ 0001h
NCO2CON_NCO2POL_MASK                     equ 0010h
NCO2CON_NCO2OUT_POSN                     equ 0005h
NCO2CON_NCO2OUT_POSITION                 equ 0005h
NCO2CON_NCO2OUT_SIZE                     equ 0001h
NCO2CON_NCO2OUT_LENGTH                   equ 0001h
NCO2CON_NCO2OUT_MASK                     equ 0020h
NCO2CON_NCO2EN_POSN                      equ 0007h
NCO2CON_NCO2EN_POSITION                  equ 0007h
NCO2CON_NCO2EN_SIZE                      equ 0001h
NCO2CON_NCO2EN_LENGTH                    equ 0001h
NCO2CON_NCO2EN_MASK                      equ 0080h

// Register: NCO2CLK
#define NCO2CLK NCO2CLK
NCO2CLK                                  equ 044Fh
// bitfield definitions
NCO2CLK_CKS_POSN                         equ 0000h
NCO2CLK_CKS_POSITION                     equ 0000h
NCO2CLK_CKS_SIZE                         equ 0004h
NCO2CLK_CKS_LENGTH                       equ 0004h
NCO2CLK_CKS_MASK                         equ 000Fh
NCO2CLK_PWS_POSN                         equ 0005h
NCO2CLK_PWS_POSITION                     equ 0005h
NCO2CLK_PWS_SIZE                         equ 0003h
NCO2CLK_PWS_LENGTH                       equ 0003h
NCO2CLK_PWS_MASK                         equ 00E0h
NCO2CLK_CKS0_POSN                        equ 0000h
NCO2CLK_CKS0_POSITION                    equ 0000h
NCO2CLK_CKS0_SIZE                        equ 0001h
NCO2CLK_CKS0_LENGTH                      equ 0001h
NCO2CLK_CKS0_MASK                        equ 0001h
NCO2CLK_CKS1_POSN                        equ 0001h
NCO2CLK_CKS1_POSITION                    equ 0001h
NCO2CLK_CKS1_SIZE                        equ 0001h
NCO2CLK_CKS1_LENGTH                      equ 0001h
NCO2CLK_CKS1_MASK                        equ 0002h
NCO2CLK_CKS2_POSN                        equ 0002h
NCO2CLK_CKS2_POSITION                    equ 0002h
NCO2CLK_CKS2_SIZE                        equ 0001h
NCO2CLK_CKS2_LENGTH                      equ 0001h
NCO2CLK_CKS2_MASK                        equ 0004h
NCO2CLK_CKS3_POSN                        equ 0003h
NCO2CLK_CKS3_POSITION                    equ 0003h
NCO2CLK_CKS3_SIZE                        equ 0001h
NCO2CLK_CKS3_LENGTH                      equ 0001h
NCO2CLK_CKS3_MASK                        equ 0008h
NCO2CLK_PWS0_POSN                        equ 0005h
NCO2CLK_PWS0_POSITION                    equ 0005h
NCO2CLK_PWS0_SIZE                        equ 0001h
NCO2CLK_PWS0_LENGTH                      equ 0001h
NCO2CLK_PWS0_MASK                        equ 0020h
NCO2CLK_PWS1_POSN                        equ 0006h
NCO2CLK_PWS1_POSITION                    equ 0006h
NCO2CLK_PWS1_SIZE                        equ 0001h
NCO2CLK_PWS1_LENGTH                      equ 0001h
NCO2CLK_PWS1_MASK                        equ 0040h
NCO2CLK_PWS2_POSN                        equ 0007h
NCO2CLK_PWS2_POSITION                    equ 0007h
NCO2CLK_PWS2_SIZE                        equ 0001h
NCO2CLK_PWS2_LENGTH                      equ 0001h
NCO2CLK_PWS2_MASK                        equ 0080h
NCO2CLK_NCO2CKS_POSN                     equ 0000h
NCO2CLK_NCO2CKS_POSITION                 equ 0000h
NCO2CLK_NCO2CKS_SIZE                     equ 0004h
NCO2CLK_NCO2CKS_LENGTH                   equ 0004h
NCO2CLK_NCO2CKS_MASK                     equ 000Fh
NCO2CLK_NCO2PWS_POSN                     equ 0005h
NCO2CLK_NCO2PWS_POSITION                 equ 0005h
NCO2CLK_NCO2PWS_SIZE                     equ 0003h
NCO2CLK_NCO2PWS_LENGTH                   equ 0003h
NCO2CLK_NCO2PWS_MASK                     equ 00E0h
NCO2CLK_NCO2CKS0_POSN                    equ 0000h
NCO2CLK_NCO2CKS0_POSITION                equ 0000h
NCO2CLK_NCO2CKS0_SIZE                    equ 0001h
NCO2CLK_NCO2CKS0_LENGTH                  equ 0001h
NCO2CLK_NCO2CKS0_MASK                    equ 0001h
NCO2CLK_NCO2CKS1_POSN                    equ 0001h
NCO2CLK_NCO2CKS1_POSITION                equ 0001h
NCO2CLK_NCO2CKS1_SIZE                    equ 0001h
NCO2CLK_NCO2CKS1_LENGTH                  equ 0001h
NCO2CLK_NCO2CKS1_MASK                    equ 0002h
NCO2CLK_NCO2CKS2_POSN                    equ 0002h
NCO2CLK_NCO2CKS2_POSITION                equ 0002h
NCO2CLK_NCO2CKS2_SIZE                    equ 0001h
NCO2CLK_NCO2CKS2_LENGTH                  equ 0001h
NCO2CLK_NCO2CKS2_MASK                    equ 0004h
NCO2CLK_NCO2CKS3_POSN                    equ 0003h
NCO2CLK_NCO2CKS3_POSITION                equ 0003h
NCO2CLK_NCO2CKS3_SIZE                    equ 0001h
NCO2CLK_NCO2CKS3_LENGTH                  equ 0001h
NCO2CLK_NCO2CKS3_MASK                    equ 0008h
NCO2CLK_NCO2PWS0_POSN                    equ 0005h
NCO2CLK_NCO2PWS0_POSITION                equ 0005h
NCO2CLK_NCO2PWS0_SIZE                    equ 0001h
NCO2CLK_NCO2PWS0_LENGTH                  equ 0001h
NCO2CLK_NCO2PWS0_MASK                    equ 0020h
NCO2CLK_NCO2PWS1_POSN                    equ 0006h
NCO2CLK_NCO2PWS1_POSITION                equ 0006h
NCO2CLK_NCO2PWS1_SIZE                    equ 0001h
NCO2CLK_NCO2PWS1_LENGTH                  equ 0001h
NCO2CLK_NCO2PWS1_MASK                    equ 0040h
NCO2CLK_NCO2PWS2_POSN                    equ 0007h
NCO2CLK_NCO2PWS2_POSITION                equ 0007h
NCO2CLK_NCO2PWS2_SIZE                    equ 0001h
NCO2CLK_NCO2PWS2_LENGTH                  equ 0001h
NCO2CLK_NCO2PWS2_MASK                    equ 0080h

