GopalSaraf/Practicals/PSDL/include/proc/pic18f27q84.inc
// Register: PWM3S1P2
#define PWM3S1P2 PWM3S1P2
PWM3S1P2                                 equ 048Bh

// Register: PWM3S1P2L
#define PWM3S1P2L PWM3S1P2L
PWM3S1P2L                                equ 048Bh
// bitfield definitions
PWM3S1P2L_S1P2L_POSN                     equ 0000h
PWM3S1P2L_S1P2L_POSITION                 equ 0000h
PWM3S1P2L_S1P2L_SIZE                     equ 0008h
PWM3S1P2L_S1P2L_LENGTH                   equ 0008h
PWM3S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM3S1P2H
#define PWM3S1P2H PWM3S1P2H
PWM3S1P2H                                equ 048Ch
// bitfield definitions
PWM3S1P2H_S1P2H_POSN                     equ 0000h
PWM3S1P2H_S1P2H_POSITION                 equ 0000h
PWM3S1P2H_S1P2H_SIZE                     equ 0008h
PWM3S1P2H_S1P2H_LENGTH                   equ 0008h
PWM3S1P2H_S1P2H_MASK                     equ 00FFh

// Register: PWM4ERS
#define PWM4ERS PWM4ERS
PWM4ERS                                  equ 048Dh
// bitfield definitions
PWM4ERS_ERS_POSN                         equ 0000h
PWM4ERS_ERS_POSITION                     equ 0000h
PWM4ERS_ERS_SIZE                         equ 0008h
PWM4ERS_ERS_LENGTH                       equ 0008h
PWM4ERS_ERS_MASK                         equ 00FFh
PWM4ERS_ERS0_POSN                        equ 0000h
PWM4ERS_ERS0_POSITION                    equ 0000h
PWM4ERS_ERS0_SIZE                        equ 0001h
PWM4ERS_ERS0_LENGTH                      equ 0001h
PWM4ERS_ERS0_MASK                        equ 0001h
PWM4ERS_ERS1_POSN                        equ 0001h
PWM4ERS_ERS1_POSITION                    equ 0001h
PWM4ERS_ERS1_SIZE                        equ 0001h
PWM4ERS_ERS1_LENGTH                      equ 0001h
PWM4ERS_ERS1_MASK                        equ 0002h
PWM4ERS_ERS2_POSN                        equ 0002h
PWM4ERS_ERS2_POSITION                    equ 0002h
PWM4ERS_ERS2_SIZE                        equ 0001h
PWM4ERS_ERS2_LENGTH                      equ 0001h
PWM4ERS_ERS2_MASK                        equ 0004h
PWM4ERS_ERS3_POSN                        equ 0003h
PWM4ERS_ERS3_POSITION                    equ 0003h
PWM4ERS_ERS3_SIZE                        equ 0001h
PWM4ERS_ERS3_LENGTH                      equ 0001h
PWM4ERS_ERS3_MASK                        equ 0008h
PWM4ERS_ERS4_POSN                        equ 0004h
PWM4ERS_ERS4_POSITION                    equ 0004h
PWM4ERS_ERS4_SIZE                        equ 0001h
PWM4ERS_ERS4_LENGTH                      equ 0001h
PWM4ERS_ERS4_MASK                        equ 0010h
PWM4ERS_ERS5_POSN                        equ 0005h
PWM4ERS_ERS5_POSITION                    equ 0005h
PWM4ERS_ERS5_SIZE                        equ 0001h
PWM4ERS_ERS5_LENGTH                      equ 0001h
PWM4ERS_ERS5_MASK                        equ 0020h
PWM4ERS_ERS6_POSN                        equ 0006h
PWM4ERS_ERS6_POSITION                    equ 0006h
PWM4ERS_ERS6_SIZE                        equ 0001h
PWM4ERS_ERS6_LENGTH                      equ 0001h
PWM4ERS_ERS6_MASK                        equ 0040h
PWM4ERS_ERS7_POSN                        equ 0007h
PWM4ERS_ERS7_POSITION                    equ 0007h
PWM4ERS_ERS7_SIZE                        equ 0001h
PWM4ERS_ERS7_LENGTH                      equ 0001h
PWM4ERS_ERS7_MASK                        equ 0080h

// Register: PWM4CLK
#define PWM4CLK PWM4CLK
PWM4CLK                                  equ 048Eh
// bitfield definitions
PWM4CLK_CLK_POSN                         equ 0000h
PWM4CLK_CLK_POSITION                     equ 0000h
PWM4CLK_CLK_SIZE                         equ 0008h
PWM4CLK_CLK_LENGTH                       equ 0008h
PWM4CLK_CLK_MASK                         equ 00FFh
PWM4CLK_CLK0_POSN                        equ 0000h
PWM4CLK_CLK0_POSITION                    equ 0000h
PWM4CLK_CLK0_SIZE                        equ 0001h
PWM4CLK_CLK0_LENGTH                      equ 0001h
PWM4CLK_CLK0_MASK                        equ 0001h
PWM4CLK_CLK1_POSN                        equ 0001h
PWM4CLK_CLK1_POSITION                    equ 0001h
PWM4CLK_CLK1_SIZE                        equ 0001h
PWM4CLK_CLK1_LENGTH                      equ 0001h
PWM4CLK_CLK1_MASK                        equ 0002h
PWM4CLK_CLK2_POSN                        equ 0002h
PWM4CLK_CLK2_POSITION                    equ 0002h
PWM4CLK_CLK2_SIZE                        equ 0001h
PWM4CLK_CLK2_LENGTH                      equ 0001h
PWM4CLK_CLK2_MASK                        equ 0004h
PWM4CLK_CLK3_POSN                        equ 0003h
PWM4CLK_CLK3_POSITION                    equ 0003h
PWM4CLK_CLK3_SIZE                        equ 0001h
PWM4CLK_CLK3_LENGTH                      equ 0001h
PWM4CLK_CLK3_MASK                        equ 0008h
PWM4CLK_CLK4_POSN                        equ 0004h
PWM4CLK_CLK4_POSITION                    equ 0004h
PWM4CLK_CLK4_SIZE                        equ 0001h
PWM4CLK_CLK4_LENGTH                      equ 0001h
PWM4CLK_CLK4_MASK                        equ 0010h
PWM4CLK_CLK5_POSN                        equ 0005h
PWM4CLK_CLK5_POSITION                    equ 0005h
PWM4CLK_CLK5_SIZE                        equ 0001h
PWM4CLK_CLK5_LENGTH                      equ 0001h
PWM4CLK_CLK5_MASK                        equ 0020h
PWM4CLK_CLK6_POSN                        equ 0006h
PWM4CLK_CLK6_POSITION                    equ 0006h
PWM4CLK_CLK6_SIZE                        equ 0001h
PWM4CLK_CLK6_LENGTH                      equ 0001h
PWM4CLK_CLK6_MASK                        equ 0040h
PWM4CLK_CLK7_POSN                        equ 0007h
PWM4CLK_CLK7_POSITION                    equ 0007h
PWM4CLK_CLK7_SIZE                        equ 0001h
PWM4CLK_CLK7_LENGTH                      equ 0001h
PWM4CLK_CLK7_MASK                        equ 0080h

// Register: PWM4LDS
#define PWM4LDS PWM4LDS
PWM4LDS                                  equ 048Fh
// bitfield definitions
PWM4LDS_LDS_POSN                         equ 0000h
PWM4LDS_LDS_POSITION                     equ 0000h
PWM4LDS_LDS_SIZE                         equ 0008h
PWM4LDS_LDS_LENGTH                       equ 0008h
PWM4LDS_LDS_MASK                         equ 00FFh
PWM4LDS_LDS0_POSN                        equ 0000h
PWM4LDS_LDS0_POSITION                    equ 0000h
PWM4LDS_LDS0_SIZE                        equ 0001h
PWM4LDS_LDS0_LENGTH                      equ 0001h
PWM4LDS_LDS0_MASK                        equ 0001h
PWM4LDS_LDS1_POSN                        equ 0001h
PWM4LDS_LDS1_POSITION                    equ 0001h
PWM4LDS_LDS1_SIZE                        equ 0001h
PWM4LDS_LDS1_LENGTH                      equ 0001h
PWM4LDS_LDS1_MASK                        equ 0002h
PWM4LDS_LDS2_POSN                        equ 0002h
PWM4LDS_LDS2_POSITION                    equ 0002h
PWM4LDS_LDS2_SIZE                        equ 0001h
PWM4LDS_LDS2_LENGTH                      equ 0001h
PWM4LDS_LDS2_MASK                        equ 0004h
PWM4LDS_LDS3_POSN                        equ 0003h
PWM4LDS_LDS3_POSITION                    equ 0003h
PWM4LDS_LDS3_SIZE                        equ 0001h
PWM4LDS_LDS3_LENGTH                      equ 0001h
PWM4LDS_LDS3_MASK                        equ 0008h
PWM4LDS_LDS4_POSN                        equ 0004h
PWM4LDS_LDS4_POSITION                    equ 0004h
PWM4LDS_LDS4_SIZE                        equ 0001h
PWM4LDS_LDS4_LENGTH                      equ 0001h
PWM4LDS_LDS4_MASK                        equ 0010h
PWM4LDS_LDS5_POSN                        equ 0005h
PWM4LDS_LDS5_POSITION                    equ 0005h
PWM4LDS_LDS5_SIZE                        equ 0001h
PWM4LDS_LDS5_LENGTH                      equ 0001h
PWM4LDS_LDS5_MASK                        equ 0020h
PWM4LDS_LDS6_POSN                        equ 0006h
PWM4LDS_LDS6_POSITION                    equ 0006h
PWM4LDS_LDS6_SIZE                        equ 0001h
PWM4LDS_LDS6_LENGTH                      equ 0001h
PWM4LDS_LDS6_MASK                        equ 0040h
PWM4LDS_LDS7_POSN                        equ 0007h
PWM4LDS_LDS7_POSITION                    equ 0007h
PWM4LDS_LDS7_SIZE                        equ 0001h
PWM4LDS_LDS7_LENGTH                      equ 0001h
PWM4LDS_LDS7_MASK                        equ 0080h

